<template>
  <v-container>
    <v-row align="center" justify="center">
      <v-col cols="12" sm="10" md="10">
        <v-col align="center" justify="center">
          <v-img src="@/assets/Head_01.png" max-width="50%"></v-img>
        </v-col>
        <v-row>
          <v-col cols="6" align="center" justify="center">
            <v-img src="@/assets/gift.png" max-width="100%"></v-img>
          </v-col>
          <v-col cols="6">
            <v-card height="500px">
              <v-toolbar card>
                <v-toolbar-title>กติกาและของรางวัล</v-toolbar-title>
              </v-toolbar>

              <v-divider></v-divider>

              <v-card-text>
                <v-list>
                  <template>
                    <v-list-tile>
                      <v-list-tile-content v-for="i in 40" :key="i">
                        <div>
                            <p><strong><span style="text-decoration: underline;">ของรางวัล </span></strong></p>
                    <p dir="ltr"><span>รางวัลที่ 1 Iphone 13 128 GB จำนวน 5&nbsp; รางวัลๆละ 29,900 บาท รวมมูลค่า 149,500
                            บาท</span></p>
                    <p dir="ltr"><span>รางวัลที่ 2&nbsp; true money wallet 30 รางวัลๆละ 5,000 บาท รวมมูลค่า 150,000
                            บาท</span>
                    </p>
                    <p dir="ltr"><span>รางวัลที่ 3&nbsp; true money wallet 25 รางวัลๆละ 3,000 บาท รวมมูลค่า&nbsp; 75,000
                            บาท</span></p>
                    <p dir="ltr">
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span>รวมมูลค่าของรางวัลทั้งสิ้น
                            374,500 บาท (สามแสนเจ็ดหมื่นสี่พันห้าร้อยบาทถ้วน)</span>
                    </p>
                    <p dir="ltr"><span style="text-decoration: underline;">วิธีการลงทะเบียนร่วมสนุก</span></p>
                    <p dir="ltr"><span>ผู้ร่วมกิจกรรมซื้อผลิตภัณฑ์กาโตะที่ร้าน เซเว่น อีเลฟเว่น โดยมีสินค้าที่ร่วมกิจกรรม 3
                            รสชาติ ได้แก่ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว ข้าวเหนียวมะม่วงอกร่อง ขนาด 320 มล. หรือ&nbsp; กาโตะ
                            น้ำผลไม้ผสมวุ้นมะพร้าว มะม่วงแรดแซสซี่ ขนาด 320 มล. และ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว
                            มะม่วงจี๊ดพริกเกลือ ขนาด 320 มล. พลิกใต้ฝาพบรหัสเพื่อร่วมโหวตรสชาติลุ้นรางวัล 1รหัส /1
                            สิทธิ์&nbsp;
                            มีวิธีร่วมกิจกรรมลุ้นรางวัลได้ 2 วิธีคือ ระบบ USSD และ Microsite ซึ่ง 1 รหัสสามารถลงทะเบียน 1
                            ระบบเท่านั้น</span></p>
                    <p dir="ltr"><span>วิธีที่ 1&nbsp; ผ่านระบบ USSD โดยผู้ร่วมกิจกรรมเข้าที่แป้นพิมพ์โทรออก กด
                            *467*66*รหัสใต้ฝา# และกดโทรออก ผู้ร่วมกิจกรรมที่ลงทะเบียนสำเร็จจะมีข้อความ SMS กลับ
                            ว่าลงทะเบียนสำเร็จแล้ว
                            หากมีการลงทะเบียนซ้ำโดยใช้รหัสเดิมจะมีข้อความตอบกลับว่าขออภัยรหัสนี้ได้ถูกใช้งานแล้ว&nbsp; และ
                            กรณีที่ใช้รหัสไม่ถูกต้อง จะมีข้อความตอบกลับว่าขออภัยรหัสของท่านไม่ถูกต้อง
                            กรุณาตรวจสอบรหัสอีกครั้ง
                            ภายในระยะเวลากิจกรรมเท่านั้น ถ้าลูกค้าลงทะเบียนก่อนระยะเวลากิจกรรม จะมีข้อความตอบกลับว่า
                            กิจกรรมเริ่มเปิดลงทะเบียนวันที่ 22 กุมภาพันธ์ 2022 และ ถ้าลูกค้าลงทะเบียนหลังระยะเวลากิจกรรม
                            จะมีข้อความตอบกลับว่า กิจกรรมได้สิ้นสุดแล้ว</span></p>
                    <p dir="ltr"><span>วิธีที่ 2 ผู้ร่วมกิจกรรมลงทะเบียนผ่าน Microsite โดยผู้ร่วมกิจกรรมสามารถสแกน QR Code
                            บนฉลากสินค้า หรือ ผ่านสื่อออนไลน์ หรือสื่อโฆษณา ณ.จุดขาย หรือลงทะเบียนผ่าน</span><a
                            href="https://katomangovote2022.com/"><span>https://katomangovote2022.com</span></a><span>&nbsp;โดย
                            ผู้ร่วมกิจกรรม ต้องกดยอดรับเงื่อนไขกิจกรรม และ กรอก ชื่อ-นามสกุล เบอร์โทร อีเมล์(ถ้ามี) วันเดือน
                            ปีเกิด ที่สามารถติดต่อได้ และ รหัสใต้ฝา โหวตรสชาติเพื่อลุ้นรางวัล
                            ในกรณีที่ลงทะเบียนสำเร็จจะขึ้นข้อความ&nbsp; &ldquo;ขอบคุณที่ร่วมกิจกรรม&rdquo;
                            หากมีการลงทะเบียนซ้ำโดยใช้รหัสเดิมจะมีขึ้นข้อความ &ldquo;ขออภัยรหัสนี้ได้ถูกใช้งานแล้ว&nbsp;
                            หากมีการลงทะเบียนรหัสไม่ถูกต้องโดยใช้รหัสเดิมจะมีขึ้นข้อความ &ldquo;ขออภัยรหัสของท่านไม่ถูกต้อง
                            กรุณาตรวจสอบรหัสอีกครั้งภายในระยะเวลากิจกรรมเท่านั้น</span></p>
                    <p dir="ltr"><span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span> เมื่อกิจกรรมสิ้นสุด
                            สำหรับรสชาติที่ได้รับการโหวตมากที่สุด จะนำรายชื่อที่โหวตรสชาตินั้นนำการจับรางวัลที่ 1 Iphone 13
                            128
                            GB จำนวน 5&nbsp; รางวัลๆละ 29,900 บาท รวมมูลค่า 149,500 บาท และ รางวัลที่ 2&nbsp; true money
                            wallet
                            30 รางวัลๆละ 5,000 บาท รวมมูลค่า 150,000 บาท และสำหรับอีก 2 รสชาติที่ได้รับการโหวตลำดับที่ 2 และ
                            3
                            จะนำรายชื่อมาจับรางวัลที่ 3 true money wallet 25 รางวัลๆละ 3,000 บาท รวมมูลค่า&nbsp; 75,000 บาท
                            ตามลำดับ</span></p>
                    <p><span style="text-decoration: underline;">กำหนดการณ์ต่าง ๆ</span></p>
                    <table class="table table-bordered">
                        <thead>
                            <tr>
                                <th width="100">
                                    วันลงทะเบียนร่วมกิจกรรม
                                </th>
                                <th width="100">
                                    วันจับรางวัล
                                </th>
                                <th width="100">
                                    วันประกาศรายชื่อผู้โชคดี
                                </th>
                                <th width="100">
                                    วันแจกรางวัล
                                </th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td width="100">
                                    วันที่ 22 กุมภาพันธ์ 2565 ถึงวันที่ 30 เมษายน 2565
                                </td>
                                <td width="100">
                                    วันที่ 17 พฤษภาคม 2565
                                </td>
                                <td width="100">
                                    วันที่ 27 พฤษภาคม 2565
                                </td>
                                <td width="100">
                                    วันที่ 30 พฤษภาคม 2565
                                </td>
                            </tr>
                        </tbody>
                    </table>
                    <p><strong><span style="text-decoration: underline;">เงื่อนไขในการรับรางวัล</span></strong></p>
                    <p dir="ltr"><span>1.</span><span>&nbsp;</span><span>บริษัทฯจะจัดพิมพ์ ชื่อ นามสกุล หมายเลขโทรศัพท์
                            และเลขรหัสใต้ฝาของผู้ร่วมรายการลงบนกระดาษตามจำนวนสิทธิ์ที่ลงทะเบียนถูกต้องและสำเร็จ
                            ตัดเป็นชิ้นส่วน
                            แล้วรวบรวมชิ้นส่วนทั้งหมดมาจับรางวัลโดยจะนำรายชื่อที่มีการโหวตรสชาติสินค้าผลิตภัณฑ์กาโตะที่ร่วมรายการ&nbsp;
                            ที่ได้รับการโหวตรสชาติที่ร่วมกิจกรรมมากที่สุดมาจับรางวัลที่ 1 และ 2 (ที่เป็นกองที่1)
                            และรสชาติที่ได้รับการโหวตในลำดับที่2และ3 จะมีการนำรายชื่อมาจับรางวัลที่ 3 ที่เป็นกองที่ 2
                            โดยใช้วิธีโยนขึ้นบนอากาศ และเชิญผู้ทรงคุณวุฒิที่น่าเชื่อถือ แขกผู้มีเกียรติ
                            จับชิ้นส่วนต่อหน้าคณะกรรมการและสักขีพยานเพื่อให้ได้รางวัลตามที่กำหนดไว้</span></p>
                    <p dir="ltr"><span>2. บริษัทฯ จะทำการจับรางวัล ณ
                        </span><span>สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (
                        </span><span>สวทช.) เลขที่ </span><span>111 อุทยานวิทยาศาสตร์ประเทศไทย ถ.พหลโยธิน ต.คลองหนึ่ง
                            อ.คลองหลวง
                            จ.ปทุมธานี 12120</span><span> โดยจะทำการจับรางวัล เวลา 14.00 น.ของวันที่ 17 พฤษภาคม 2565</span>
                    </p>
                    <p dir="ltr"><span>3. เมื่อจับรางวัลเรียบร้อยแล้ว บริษัท โมบาย คอนเน็ค จำกัด (ตัวแทนของบริษัท ทวีผล
                            ผลิตภัณฑ์ จำกัด) จะทำการตรวจสอบและติดต่อกลับไปยังผู้โชคดีที่ได้รับรางวัล
                            ตามหมายเลขที่ได้ลงทะเบียนร่วมกิจกรรม เพื่อแจ้งรายละเอียดในการรับรางวัลต่อไป
                            โดยจะเริ่มทำการติดต่อผู้โชคดีตั้งแต่วันที่ 18-24 พฤษภาคม 2565
                            (ยกเว้นวันหยุดเสาร์-อาทิตย์และวันหยุดนักขัตฤกษ์)
                            หากไม่สามารถติดต่อได้</span><span>จะดึงรายชื่อลำดับสำรองขึ้นมาแทน
                            (ลำดับสำรองเรียงตามลำดับตอนจับรางวัล)</span></p>
                    <p dir="ltr"><span>4. บริษัทฯ จะประกาศรายชื่อผู้ที่ได้รับรางวัลผ่านทาง Facebook Kato Fruit n Fun และ
                            ช่องทาง
                            Line OA @KATOTHAILAND ของวันที่ 27 พฤษภาคม 2565 เวลา 16.00 น หรือสอบถามเพิ่มเติมได้ที่ เบอร์
                            0-2938-3878 (ในวันจันทร์ - ศุกร์ เวลา 8.30 &ndash; 17.30 น.)</span></p>
                    <p dir="ltr"><span>5. หลังจากที่ประกาศผล รายชื่อ ผู้โชคดีแล้ว หากผู้โชคดีไม่ติดต่อกลับภายเพื่อยืนยันใน
                            30
                            วันจากวันที่ประกาศผลถือว่าผู้โชคดีได้สละสิทธิ์ หลังจากนั้น ทางบริษัทจะให้สิทธิ
                            การได้รับรางวัลแก่ผู้ที่ได้รางวัลสำรองลำดับถัดไป</span></p>
                    <p dir="ltr"><span>6. บริษัทฯ จะมอบรางวัลแก่ผู้โชคดีหลังจากประกาศรายชื่อผู้โชคดีเรียบร้อยแล้ว
                            ผู้โชคดีที่ได้รับรางวัลจะต้องมารับรางวัลด้วยตัวเองหรือมอบอำนาจให้ผู้อื่นมารับรางวัล ณ บริษัท
                            โมบาย
                            คอนเน็ค จํากัด (สํานักงานใหญ่) 1111/84 ถนนลาดพร้าว แขวงจันทรเกษม เขตจตุจักร กรุงเทพฯ 10900&nbsp;
                            วันที่ 30 พฤษภาคม&nbsp; 2565</span></p>
                    <p dir="ltr"><span>7.ผู้โชคดีที่ได้รับรางวัลต้องมาติดต่อขอรับของรางวัล โดยจะต้องนำบัตรประจำตัวประชาชน
                            หรือบัตรข้าราชการตัวจริง, สำเนาทะเบียนบ้าน ฝาที่มีรหัสใต้ฝา และมีข้อมูลตรงกับฉลากที่จับ
                            และอยู่ในสภาพสมบูรณ์ โดยต้องไม่มีการดัดแปลง แก้ไข ทำซ้ำรอยตัวพิมพ์เดิม หรือทำการใด
                            ๆเพื่อให้ได้มาโดยไม่ชอบ ซึ่งจะถือเป็นโมฆะและไม่มีสิทธิ์รับรางวัล หากหลักฐานไม่ครบ ทางบริษัทฯ
                            จะมอบรางวัลดังกล่าว ให้กับรายชื่อสำรองลำดับถัดไป</span></p>
                    <p dir="ltr"><span>7.1 กรณีเป็นเด็กที่อายุต่ำกว่า 18 ปี
                            ต้องมีสำเนาบัตรประชาชนของผู้ปกครองมาแสดงด้วย</span>
                    </p>
                    <p dir="ltr"><span>7.2 กรณีมอบอำนาจ ให้ทำหนังสือมอบอำนาจ ติดอากรแสตมป์ 10 บาท
                            โดยเอกสารที่ใช้ได้แก่สำเนาทะเบียนบ้าน, สำเนาบัตรประชาชนของผู้ที่ได้รับรางวัล
                            พร้อมใบเสร็จที่ได้รับรางวัล และนำสำเนาบัตรประชาชนของผู้รับมอบอำนาจแนบมาด้วย
                            กรณีไม่สามารถมารับของรางวัลได้ด้วยตนเอง สามารถมอบอำนาจได้สูงสุด 1 คนต่อ 1 รางวัล</span></p>
                    <p dir="ltr"><span>8. พนักงาน และครอบครัว ของ พนักงานบริษัท ทวีผล ผลิตภัณฑ์ จำกัดและ บริษัทตัวแทนโฆษณา
                            รวมถึงบริษัทที่เกี่ยวข้องกับการจัดกิจกรรม ไม่มีสิทธิ์เข้าร่วมรายการนี้</span></p>
                    <p dir="ltr"><span>9.ตลอดระยะเวลาการร่วมกิจกรรม ผู้โชคดีที่ได้รับรางวัลมากกว่า 1 รางวัล
                            จะมีสิทธิ์ได้รับรางวัลที่มีมูลค่าสูงสุดได้เพียงรางวัลเดียวเท่านั้น
                            โดยของรางวัลไม่สามารถแลกเปลี่ยนเป็นเงินสด หรือสิ่งของอื่นใดได้
                            และไม่สามารถโอนสิทธิ์ให้ผู้อื่นได้</span></p>
                    <p dir="ltr"><span>10.บริษัทฯ ขอสงวนสิทธิ์ในการจับรางวัลสำรอง
                            ในกรณีที่ผู้โชคดีมีคุณสมบัติไม่ครบถ้วนในการขอรับรางวัล
                            และไม่สามารถมาติดต่อเพื่อรับรางวัลได้ภายในระยะเวลาที่ทางบริษัทฯ กำหนดไว้</span></p>
                    <p dir="ltr"><span>10.ผู้โชคดีที่ได้รับรางวัลต้องชำระภาษี ณ ที่จ่าย 5%ของมูลค่าของรางวัล ตั้งแต่1,000
                            บาทเป็นต้นไปตามคำสั่งกรมสรรพากรที่ ที่ ทป. 4/2528 ลงวันที่ 26 กันยายน 2528
                            ประกอบคำสั่งกรมสรรพากร
                            ที่ ท.ป. 104/2544 ลงวันที่&nbsp; &nbsp; &nbsp; 15 กันยายน 2544</span></p>
                    <p dir="ltr"><span>11.ผลการจับรางวัลและคำตัดสินของ บริษัท ทวีผล ผลิตภัณฑ์ จำกัด
                            ถือเป็นเด็ดขาดและสิ้นสุด</span></p>
                    <p dir="ltr"><span>12.บริษัทฯ ถือว่าผู้ร่วมกิจกรรมทุกราย ในช่วงระยะเวลาการจัดกิจกรรมส่งเสริมการขายนี้
                            ได้ตกลงยอมรับข้อกำหนดตามกติกาและเงื่อนไขของการร่วมกิจกรรมชิงรางวัลนี้ทุกประการ</span></p>
                    <p dir="ltr"><span>13.ผู้โชคดีที่ได้รับรางวัลอนุญาตให้ทีมงานฯ บันทึกภาพการเข้าร่วมกิจกรรมทุกขั้นตอน
                            พร้อมทั้งอนุญาตให้บริษัท ทวีผล ผลิตภัณฑ์ จำกัด นำชื่อ-นามสกุล
                            และรายละเอียดอื่นใดของลูกค้าผู้ได้รับรางวัลรวมถึงภาพถ่ายของผู้ที่ได้รับรางวัล
                            ออกเผยแพร่เพื่อการประชาสัมพันธ์ได้ในสื่อทุกชนิด โดยไม่มีค่าตอบแทนใดๆทั้งสิ้น
                            ไม่ว่าจะประกอบอาชีพใดๆ
                            และไม่ต้องแจ้งให้ทราบล่วงหน้า</span></p>
                    <p dir="ltr"><span>14.กิจกรรมนี้เฉพาะผู้ที่มีสัญชาติไทยและพำนักอาศัยอยู่ในประเทศไทยเท่านั้น</span></p>
                        </div>
                       
                      </v-list-tile-content>
                    </v-list-tile> 
                  
                  </template>
                </v-list>
              </v-card-text>      
              <v-col align="center" justify="center">
                        <router-link :to="'/menu'"><v-btn
                        elevation="2"
                        color="grey"
                        class="white--text pa-5 mr-4"
                        rounded
                        >ย้อนกลับ</v-btn></router-link>
                </v-col>
            </v-card></v-col
          >
        </v-row>
      </v-col></v-row
    ></v-container
  >
</template>

<script>
export default {};
</script>

<style>
.v-card {
  display: flex !important;
  flex-direction: column;
}

.v-card__text {
  flex-grow: 1;
  overflow: auto;
}
</style>