<template>
  <v-row justify="center">
    <v-dialog v-model="showPDPA" scrollable persistent>
      <v-card>
        <v-layout justify-center>
          <v-card-title style="color: red">ข้อตกลงและเงื่อนไข</v-card-title>
        </v-layout>
        <v-card-text style="height: 500px" class="text-left"
          ><p>
            ขอบคุณที่มาเยี่ยมชมเว็บไซด์ในกลุ่มบริษัทในเครือ Mattress City
            ส่วนตัวของคุณเป็นสิ่งสําคัญสําหรับเรา ด้วยเหตุนี้
            เราจึงมีนโยบายความเป็นส่วนตัว (“นโยบายความเป็นส่วนตัว“)
            นี้อธิบายแนวทางปฏิบัติเกี่ยวกับข้อมูลออนไลน์ของเราและทางเลือกที่คุณสามารถทําได้เกี่ยวกับวิธีเก็บรวบรวมและใช้งานโดยบริการดิจิทัลนี้
            ซึ่งรวมถึงเว็บไซต์ออนไลน์หรือมือถือ แอปพลิเคชัน
            หรือบริการดิจิทัลที่เป็นของ, ดําเนินการหรือนําเสนอโดยในนามของ
            Mattress City รวมถึงเว็บไซต์ออนไลน์หรือโทรศัพท์มือถือ,
            โปรแกรมประยุกต์หรือบริการดิจิทัลซึ่งนโยบายความเป็นส่วนตัวนี้ปรากฏ
            (“บริการ” ) “ผู้ใช้” คือบุคคลที่ใช้บริการ
          </p>

          <p>ข้อมูลที่เรารวบรวม</p>

          <p>
            เราได้รับข้อมูลทั้งที่จัดหาให้โดยตรงแก่เรา เช่น
            ข้อมูลส่วนบุคคลที่คุณให้ไว้เมื่อคุณเยี่ยมชมบริการ
            และข้อมูลที่ถูกรวบรวมจากคุณอย่างไม่เปิดเผยหรือโดยอัตโนมัติ เช่น
            ข้อมูลที่ไม่ระบุชื่อที่เก็บรวบรวมจากเบราว์เซอร์หรืออุปกรณ์ของคุณ
            ในนโยบายความเป็นส่วนตัวนี้เราจะเรียกรวมว่า “ข้อมูล“
          </p>

          <ol>
            <li>
              <p>
                ข้อมูลที่คุณให้กับเรา
                ในบริการบางอย่างคุณสามารถลงทะเบียนสั่งซื้อผลิตภัณฑ์
                เข้าร่วมการแข่งขันลงคะแนนในแบบสํารวจ
                หรือแสดงความคิดเห็นสมัครใช้บริการของเราเช่นจดหมายข่าวออนไลน์ของเราหรือข้อความแจ้งเตือนหรือเข้าร่วมในหนึ่งในฟอรั่มออนไลน์หรือชุมชนของเรา
                ในการนำเสนอข้อเสนอต่างๆเหล่านี้เรามักจะพยายามที่จะเก็บรวบรวมของข้อมูลรูปแบบต่าง
                ๆเช่น: ชื่อ ที่อยู่ ที่อยู่อีเมล หมายเลขโทรศัพท์
                หมายเลขโทรสารและข้อมูลบัตรเครดิต ในบริการบางอย่าง
                คุณอาจสามารถส่งข้อมูลเกี่ยวกับบุคคลอื่นได้ ตัวอย่างเช่น
                คุณอาจส่งชื่อบุคคลและที่อยู่อีเมลเพื่อส่งบัตรอวยพรอิเล็กทรอนิกส์
                และถ้าคุณสั่งซื้อของขวัญออนไลน์
                และต้องการให้ส่งโดยตรงไปยังผู้รับ
                คุณอาจส่งชื่อและที่อยู่ของผู้รับ ข้อมูลนี้อาจรวมถึงชื่อผู้รับ
                ที่อยู่ ที่อยู่อีเมล และหมายเลขโทรศัพท์
              </p>
            </li>
            <li>
              <p>
                ข้อมูลที่เก็บรวบรวมอย่างไม่โต้ตอบหรือโดยอัตโนมัติ เราและ
                “พันธมิตร” ของเราซึ่งรวมถึงผู้ให้บริการบุคคลที่สาม, ผู้ลงโฆษณา,
                เครือข่ายการโฆษณาและแพลตฟอร์ม,
                หน่วยงานและการกระจายสินค้าหรือคู่ค้าอื่นๆ
                อาจใช้วิธีการอัตโนมัติในการรวบรวมข้อมูลประเภทต่างๆ เกี่ยวกับคุณ,
                คอมพิวเตอร์หรืออุปกรณ์อื่นๆ ที่ใช้ในการเข้าถึงบริการของเรา
                รายชื่อที่เป็นตัวแทนที่ไม่ครบถ้วนสมบูรณ์ของประเภทของข้อมูลที่เก็บรวบรวมโดยอัตโนมัติอาจรวมถึง:
                เครือข่ายหรือที่อยู่โปรโตคอลอินเทอร์เน็ตและประเภทของเบราว์เซอร์ที่คุณใช้
                (เช่น Chrome, Safari, Firefox, Internet Explorer)
                ประเภทของระบบปฏิบัติการที่คุณใช้อยู่ (เช่น Microsoft Windows
                หรือ Mac OS)
                ชื่อของผู้ให้บริการอินเทอร์เน็ตและโดเมนที่ใช้โดยผู้ให้บริการดังกล่าว
                เครือข่ายมือถือ, ตัวระบุอุปกรณ์ (เช่น Apple IDFA หรือรหัสโฆษณา
                Android) การตั้งค่าอุปกรณ์ การตั้งค่าเบราว์เซอร์
                หน้าเว็บของบริการที่คุณเยี่ยมชม โปรดดูส่วนที่ 4 ของเราที่ชื่อว่า
                คุกกี้ และเทคโนโลยีผู้ใช้อื่นและการกําหนดเป้าหมายโฆษณา
                เพื่อดูข้อมูลเพิ่มเติมเกี่ยวกับวิธีการเก็บรวบรวมและนําไปใช้ข้อมูลเหล่านี้
              </p>
            </li>
            <li>
              <p>
                ข้อมูลตําแหน่งทางภูมิศาสตร์
                หากคุณกําลังเข้าถึงบริการจากอุปกรณ์เคลื่อนที่หรือผ่านแอปพลิเคชันบนอุปกรณ์เคลื่อนที่
                คุณอาจถูกขอให้แบ่งปันข้อมูลตําแหน่งทางภูมิศาสตร์ (ระดับ GPS)
                ที่แม่นยําของคุณกับเรา
                เพื่อให้เราสามารถปรับแต่งประสบการณ์ของคุณในบริการของเราหรือบริการอื่นๆ
                เมื่อเราทํางานร่วมกับพันธมิตร เช่น
                แพลตฟอร์มโฆษณาบนมือถือของบุคคลที่สาม หากคุณยอมรับการเก็บดังกล่าว
                ในกรณีส่วนใหญ่คุณจะสามารถปิดการเก็บรวบรวมข้อมูลดังกล่าวได้ตลอดเวลาโดยการเข้าถึงการตั้งค่าความเป็นส่วนตัวของอุปกรณ์มือถือของคุณและ
                / หรือผ่านการตั้งค่าในแอปพลิเคชันมือถือที่เกี่ยวข้อง
              </p>
            </li>
            <li>
              <p>
                ข้อมูลที่เก็บรวบรวมโดยและจากบริการสื่อสังคมออนไลน์และแพลตฟอร์ม
                ของบุคคลที่สามอื่น ๆ คุณยังสามารถมีส่วนร่วมกับเนื้อหาของเรา เช่น
                วิดีโอ เกม แอปพลิเคชัน และข้อเสนออื่นๆ
                บนหรือผ่านบริการสื่อสังคมออนไลน์
                หรือแพลตฟอร์มของบุคคลที่สามอื่นๆ เช่น Facebook
                หรือปลั๊กอินโซเชียลมีเดียอื่นๆ การผสานการทํางาน
                และแอปพลิเคชันอื่นๆ
                เมื่อคุณมีส่วนร่วมกับเนื้อหาของเราบนหรือผ่านบริการสื่อสังคมออนไลน์หรือแพลตฟอร์มบุคคลที่สามปลั๊กอินการผสานการทํางานหรือแอปพลิเคชันอื่น
                ๆ คุณอาจอนุญาตให้เราเข้าถึงข้อมูลบางอย่างในโปรไฟล์ของคุณได้
                ซึ่งอาจรวมถึงชื่อ ที่อยู่ อีเมลของคุณ ภาพถ่าย เพศ วันเกิด ID
                ที่เชื่อมโยงกับแพลตฟอร์มของบุคคลที่สามหรือไฟล์ผู้ใช้บัญชีโซเชียลมีเดียที่เกี่ยวข้อง
                เช่น รูปถ่ายและวิดีโอ
                รายชื่อเพื่อนหรือการเชื่อมต่อบุคคลที่คุณติดตาม
                และ/หรือผู้ที่ติดตามคุณ หรือโพสต์ของคุณ หรือ “การกดถูกใจ” ของคุณ
                สําหรับคําอธิบายเกี่ยวกับวิธีการบริการสื่อสังคมออนไลน์และแพลตฟอร์มของบุคคลที่สามปลั๊กอิน
                การผสานรวม หรือแอปพลิเคชันจัดการข้อมูลของคุณ
                (โปรดดูที่นโยบายความเป็นส่วนตัวและเงื่อนไขการใช้งานที่เกี่ยวข้อง)ซึ่งอาจอนุญาตให้คุณแก้ไขการตั้งค่าความเป็นส่วนตัวของคุณ
                เมื่อเราโต้ตอบกับคุณผ่านเนื้อหาของเราบนเว็บไซต์แอปพลิเคชันการผสานการทํางานหรือแพลตฟอร์มของบุคคลที่สาม
                เราอาจได้รับข้อมูลเกี่ยวกับการปฏิสัมพันธ์ของคุณกับเนื้อหานั้น
                เช่น เนื้อหาที่คุณดู ประสิทธิภาพเกม คะแนนสูง
                และข้อมูลเกี่ยวกับโฆษณาภายในเนื้อหาที่คุณแสดงหรืออาจคลิก
              </p>
            </li>
          </ol>
          <p>II. วิธีที่เราใช้ข้อมูล</p>

          <p>เราร่วมกับพันธมิตรของเราใช้ข้อมูลเพื่อ:</p>

          <ol>
            <li>
              <p>ให้บริการและติดต่อสื่อสารกับคุณเกี่ยวกับกิจกรรมของเรา</p>
            </li>
            <li>
              <p>
                ตอบสนองคําขอของคุณเกี่ยวกับบริการ
                รวมถึงแต่ไม่จํากัดเฉพาะการร้องขอจดหมายข่าวและการแจ้งเตือน
              </p>
            </li>
            <li>
              <p>
                ตอบคําถามของคุณ และแจ้งให้คุณทราบหากคุณได้รับรางวัลจากการประกวด
              </p>
            </li>
            <li>
              <p>โปรแกรม หรือบริการอื่นๆ ที่เราเชื่อว่าเป็นประโยชน์ต่อคุณ</p>
            </li>
            <li>
              <p>
                บังคับใช้ข้อกําหนดทางกฎหมาย
                (รวมถึงแต่ไม่จํากัดเฉพาะนโยบายและข้อกําหนดในการให้บริการของเรา)
                ที่ควบคุมการใช้งานบริการของเราและ/หรือเพื่อวัตถุประสงค์ที่คุณให้ไว้
              </p>
            </li>
            <li><p>ให้บริการทางเทคนิคและการสนับสนุน</p></li>
            <li>
              <p>
                ป้องกันการทุจริตหรือการกระทําที่ผิดกฎหมาย
                (รวมถึงแต่ไม่จํากัดเฉพาะการละเมิดลิขสิทธิ์) บนหรือผ่านบริการ
              </p>
            </li>
            <li><p>ปกป้องความปลอดภัยของผู้ใช้ของเรา</p></li>
            <li>
              <p>
                ปรับแต่งหรือปรับแต่งโฆษณาข้อเสนอและเนื้อหาที่พร้อมให้บริการสําหรับคุณโดยอิงจากการเข้าชมและ/หรือการใช้งานบริการหรือเว็บไซต์ออนไลน์หรือมือถือแอปพลิเคชันหรือบริการอื่น
                ๆ และวิเคราะห์ประสิทธิภาพของโฆษณาข้อเสนอและเนื้อหาเหล่านั้น
                ตลอดจนการโต้ตอบของคุณกับพวกเขา
              </p>
            </li>
            <li>
              <p>ดําเนินการวิเคราะห์เกี่ยวกับการใช้บริการหรือส่วนใดส่วนหนึ่ง</p>
            </li>
            <li>
              <p>
                ส่งของขวัญ บัตร เชิญ
                หรืออีเมลไปยังผู้รับที่กําหนดของคุณหากคุณใช้บริการเหล่านี้
              </p>
            </li>
          </ol>
          <p>
            เมื่อคุณให้ข้อมูลจากบัญชีโซเชียลมีเดียของคุณจะช่วยให้เราสามารถทําสิ่งต่างๆ
            เช่น (1) มอบเนื้อหาพิเศษ (2)
            ปรับแต่งประสบการณ์ออนไลน์ของคุณกับเราภายในและนอกบริการของเรา (3)
            ติดต่อคุณผ่านบริการสื่อสังคมออนไลน์หรือโดยตรงโดยการส่งข่าวสารล่าสุด
            ข้อเสนอพิเศษ และของรางวัลและ (4)
            ช่วยให้คุณสามารถแบ่งปันประสบการณ์และเนื้อหาผ่านบริการสื่อสังคมออนไลน์
            เมื่อคุณให้ข้อมูลเกี่ยวกับตัวคุณกับเราผ่านแอปพลิเคชันผ่านบริการของเราหรือบนบริการสื่อสังคมออนไลน์หรือแพลตฟอร์มของบุคคลที่สามอื่น
            ๆ โดยสมาชิกสาธารณะคนอื่น ๆ
            อาจดูบริการเหล่านี้และเราไม่สามารถป้องกันการใช้ข้อมูลโดยบุคคลที่สามได้
          </p>

          <p>
            เราหรือคู่ค้าอาจใช้ “คุกกี้”
            หรือเทคโนโลยีที่คล้ายคลึงกันเพื่อเชื่อมโยงข้อมูลบางอย่างกับตัวระบุที่ไม่ซ้ําซึ่งเชื่อมโยงข้อมูลกับอุปกรณ์หรือเบราว์เซอร์ของคุณ
            สําหรับข้อมูลเกี่ยวกับวิธีการทํางานของเทคโนโลยีเหล่านี้และวิธีที่เราอาจใช้เทคโนโลยีเหล่านี้
            บางครั้งเราอาจเชื่อมโยงคุกกี้กับข้อมูล รวมถึงข้อมูลที่ยกเลิกการระบุ
            “แฮช” หรือข้อมูลเวอร์ชันที่ไม่ระบุชื่อที่คุณให้ไว้ (เช่น
            ระหว่างการลงทะเบียน)
            เพื่อส่งหรือช่วยพันธมิตรส่งโฆษณาและข้อเสนอตามความสนใจหรือข้อมูลประชากรที่คุณกําหนด
          </p>

          <p>
            เราอาจรวมข้อมูลใดๆ ที่เราเก็บรวบรวมไว้เพื่อวัตถุประสงค์ใดๆ ข้างต้น
            และอาจเพิ่มข้อมูลกับข้อมูลอื่นๆ
            ที่เราได้รับจากแหล่งข้อมูลของบุคคลที่สาม
            โปรดทราบว่าหากคุณเลือกที่จะส่งข้อมูลหรือเนื้อหาสําหรับสิ่งพิมพ์
            (เช่น จดหมายถึงบรรณาธิการ
            ความคิดเห็นที่ส่งถึงบุคคลทางโทรทัศน์ของเราการโพสต์ไปยังบล็อกหรือกระดานสนทนา
            บทความหรือวิดีโอ) เราอาจเผยแพร่ข้อมูลและเนื้อหาพร้อมกับข้อมูลอื่น ๆ
            เกี่ยวกับคุณ (เช่นชื่อของคุณชื่อหน้าจอหรือตําแหน่ง)
            ในทํานองเดียวกันหากคุณลงทะเบียนและสร้างโปรไฟล์กับบริการของเราชื่อหน้าจอที่คุณเลือกและเนื้อหาอื่น
            ๆ ที่คุณส่งไปยังโปรไฟล์ของคุณ (เช่นภาพถ่าย ความคิดเห็น วิดีโอรีวิว
            โพสต์ บทความ) จะปรากฏต่อสาธารณชนบนบริการ
            สามารถค้นหาได้โดยบุคคลที่สามและอาจจะถูกเผยแพร่อีกครั้งและเผยแพร่ซ้ําโดยดุลยพินิจของเราแต่เพียงผู้เดียว
            โปรดดูข้อกําหนดการใช้งานของเราสําหรับรายละเอียดเกี่ยวกับการใช้งานเนื้อหาที่คุณส่ง
          </p>

          <p>III. การแบ่งปันและการเปิดเผยข้อมูล</p>

          <p>เราอาจเปิดเผยข้อมูลดังต่อไปนี้</p>

          <ol>
            <li>
              <p>
                เพื่อผู้ให้บริการหรือพันธมิตรที่เรามีส่วนร่วมในการดําเนินธุรกิจที่เกี่ยวข้องกับการทํางานในนามของเรา
                ซึ่งอาจรวมถึงผู้ให้บริการที่: (ก)
                ดําเนินการวิจัยและการวิเคราะห์; (ข) สร้างเนื้อหา; (ค)
                ให้การสนับสนุนลูกค้า ด้านเทคนิค หรือการดําเนินงาน (ง)
                ดําเนินการหรือสนับสนุนการตลาด (เช่น อีเมลหรือแพลตฟอร์มการโฆษณา)
                (จ) ปฏิบัติตามคําสั่งและคําขอของผู้ใช้ (ฉ) จัดการการชําระเงิน;
                (ช) โฮสต์บริการ ฟอรัม และชุมชนออนไลน์ของ (ซ) จัดการการแข่งขัน;
                (ฌ) เก็บรักษาฐานข้อมูล(ญ)
                ส่งหรือสนับสนุนการโฆษณาออนไลน์หรือมือถือ และ (ฏ)
                สนับสนุนบริการของเรา
              </p>
            </li>
            <li>
              <p>
                ปฏิบัติตามและตอบสนองต่อกระบวนการทางกฎหมาย ตัวอย่างเช่นการ
                ตอบสนองต่อคําสั่งศาลหรือหมายศาล
              </p>
            </li>
            <li>
              <p>
                กับบุคคลที่สามเพื่อตรวจสอบ ป้องกัน หรือกระทําการ
                (ตามดุลพินิจของเรา) เกี่ยวกับกิจกรรมที่ผิดกฎหมาย
                สถานการณ์ที่เกี่ยวข้องกับการคุกคามที่อาจเกิดขึ้นกับบุคคลใด ๆ
                เราหรือบริการหรือการละเมิดนโยบายของเรา
                การตรวจสอบหรือการปฏิบัติตามกฎหมายหรือข้อกําหนดการใช้งานที่บังคับใช้กับบริการของเรา
              </p>
            </li>
            <li>
              <p>
                เราอาจโอนข้อมูลบางส่วนหรือทั้งหมดของคุณหากเราหรือหนึ่งในหน่วยธุรกิจของเรามีการเปลี่ยนแปลงทางธุรกิจเช่นการควบรวมกิจการโดย
                บริษัท
                อื่นหรือการขายสินทรัพย์ทั้งหมดหรือบางส่วนของเราหรือส่วนสําคัญของสินทรัพย์ของหน่วยธุรกิจหรือการขายหรือรวมกันในลักษณะนี้
              </p>
            </li>
            <li>
              <p>
                เราอาจแบ่งปันข้อมูลกับคู่ค้าที่ไม่เป็นพันธมิตรและบุคคลที่สาม
                (เช่น ผู้ให้บริการบุคคลที่สาม ของเรา ผู้ลงโฆษณา เครือข่ายโฆษณา
                และแพลตฟอร์ม เอเจนซี นักการตลาดอื่นๆ ผู้จัดพิมพ์นิตยสาร
                ผู้ค้าปลีก ฐานข้อมูลแบบมีส่วนร่วม และองค์กรที่ไม่หวังผลกําไร)
                ที่ต้องการทําการตลาดผลิตภัณฑ์หรือบริการแก่คุณ
                หากคุณต้องการที่จะปฏิเสธจากการแบ่งปันดังกล่าวโปรดไปที่วิธีการติดต่อเรา
                / เลือกที่จะไม่ขอรับการสื่อสารการตลาด
                ด้านล่างสําหรับคําแนะนําเพิ่มเติม
              </p>
            </li>
          </ol>
          <p>
            โปรดทราบว่าบริการที่ครอบคลุมโดยนโยบายความเป็นส่วนตัวนี้อาจนําเสนอเนื้อหา
            (เช่น การแข่งขัน ชิงโชค โปรโมชั่น เกม แอปพลิเคชัน
            หรือการผสานรวมเครือข่ายทางสังคม)
            ที่ได้รับการสนับสนุนโดยหรือร่วมแบรนด์กับบุคคลที่สามที่ระบุ
            โดยอาศัยอํานาจของความสัมพันธ์เหล่านี้บุคคลที่สามอาจได้รับข้อมูลจากผู้เข้าชมของพวกเขา
            เราไม่มีอํานาจควบคุมการใช้ข้อมูลนี้ของบุคคลที่สามซึ่งอยู่ภายใต้นโยบายความเป็นส่วนตัวของตนเอง
          </p>

          <p>
            IV. คุกกี้และเทคโนโลยีการกําหนดเป้าหมายโฆษณาของผู้ใช้อื่นๆ
            เราใช้คุกกี้และเทคโนโลยีอื่นๆ ทั้งเพื่อให้บริการแก่คุณและโฆษณาให้คุณ
            นอกจากนี้ เราอาจทํางานร่วมกับ พันธมิตร
            เพื่อช่วยพวกเขาโฆษณาให้คุณเมื่อคุณเยี่ยมชมเว็บไซต์หรือแอปพลิเคชันบนอุปกรณ์เคลื่อนที่อื่นๆ
            และเพื่อช่วยพวกเขาทําการวิเคราะห์ผู้ใช้
            เทคโนโลยีเหล่านี้อาจใช้เพื่อวิเคราะห์วิธีที่ผู้ใช้ของเราโต้ตอบกับการโฆษณาในบริการของเราและที่อื่นๆ
            เพื่อเรียนรู้เพิ่มเติมเกี่ยวกับผู้ใช้ของเราและการบริการหรือข้อเสนอที่คุณอาจต้องการรับ
            เราอธิบายเทคโนโลยีเหล่านี้ด้านล่าง
          </p>

          <ol>
            <li>
              <p>
                คุกกี้ เราและพันธมิตรของเราใช้ “คุกกี้” “เว็บบีคอน”
                หรือเทคโนโลยีการติดตามอื่นๆ
                เพื่อเพิ่มประสิทธิภาพการใช้งานออนไลน์ของคุณ
                คุกกี้คือไฟล์ข้อความที่อยู่ในเบราว์เซอร์ของคอมพิวเตอร์ของคุณเพื่อเก็บค่ากําหนดของคุณ
                เราใช้คุกกี้หรือเทคโนโลยีการติดตามอื่นๆ
                เพื่อทําความเข้าใจเกี่ยวกับการใช้บริการและการใช้อินเทอร์เน็ต
                และปรับปรุงหรือปรับแต่งผลิตภัณฑ์ เนื้อหา ข้อเสนอ บริการ
                หรือโฆษณาในบริการของเรา ตัวอย่างเช่น
                เราอาจใช้คุกกี้เพื่อปรับเปลี่ยนประสบการณ์ของคุณที่บริการของเรา
                (เช่น รู้จักคุณด้วยชื่อเมื่อคุณกลับสู่บริการ)
                ให้บันทึกรหัสผ่านของคุณในพื้นที่ที่มีการป้องกันด้วยรหัสผ่าน
                และช่วยให้คุณสามารถใช้รถเข็นซื้อของในบริการของเราได้
                เรายังอาจใช้คุกกี้หรือเทคโนโลยีการติดตามอื่นๆ
                เพื่อช่วยให้เรานําเสนอผลิตภัณฑ์ เนื้อหา ข้อเสนอ
                หรือบริการที่คุณอาจสนใจและเพื่อแสดงโฆษณาที่เกี่ยวข้องเมื่อคุณเยี่ยมชมบริการนี้
                เราหรือแพลตฟอร์มของบุคคลที่สามที่เราทํางานอาจวางหรือจดจําคุกกี้ที่ไม่ซ้ํากันบนเบราว์เซอร์ของคุณเพื่อให้คุณสามารถได้รับเนื้อหาที่กําหนดเองข้อเสนอบริการหรือโฆษณาในบริการของเราหรือเว็บไซต์อื่น
                ๆ
                คุกกี้เหล่านี้ไม่มีข้อมูลใดที่มีวัตถุประสงค์เพื่อระบุตัวตนของคุณ
                คุกกี้อาจเกี่ยวข้องกับข้อมูล de-identified demographic
                หรือข้อมูลอื่น ๆ
                ที่เชื่อมโยงหรือได้รับมาจากข้อมูลที่คุณส่งให้เราโดยสมัครใจ (เช่น
                ที่อยู่อีเมลของคุณ)
                ที่เราอาจแบ่งปันกับผู้ให้บริการในรูปแบบแฮชเพียงอย่างเดียวซึ่งไม่ใช่บุคคล
                เราผู้ให้บริการบุคคลที่สามของเราผู้โฆษณาเครือข่ายโฆษณาและแพลตฟอร์มหน่วยงานหรือพันธมิตรของเราอาจใช้คุกกี้หรือเทคโนโลยีการติดตามอื่น
                ๆ
                ในการจัดการและวัดประสิทธิภาพของโฆษณาที่แสดงบนหรือส่งผ่านหรือผ่านโคโคนัทและ
                / หรือเครือข่ายหรือบริการอื่น ๆ
                นอกจากนี้ยังช่วยให้เราผู้ให้บริการและพันธมิตรของเราให้การโฆษณาที่เกี่ยวข้องมากขึ้น
              </p>
            </li>
            <li>
              <p>
                การซิงค์คุกกี้และตัวระบุ เราอาจทํางานร่วมกับพันธมิตรของเรา (เช่น
                แพลตฟอร์มโฆษณาของบุคคลที่สาม)
                เพื่อซิงโครไนซ์ตัวระบุที่ไม่ระบุตัวตน (เช่น
                ตัวระบุที่เชื่อมโยงกับคุกกี้)
                เพื่อให้ตรงกับตัวระบุผู้ใช้ที่เข้ารหัสเฉพาะของพันธมิตรของเรากับเราเอง
                เราอาจทําการเพิ่มจุดข้อมูลเกี่ยวกับเบราว์เซอร์หรืออุปกรณ์เฉพาะโดยเฉพาะและทําให้เราหรือผู้อื่นสามารถส่งโฆษณาที่เกี่ยวข้องมากขึ้น
                จับคู่ผู้ใช้
                กับผลิตภัณฑ์ที่สนใจหรือเพื่อการประสานเข้ากันที่ดีกว่าหรือเพิ่มประสิทธิภาพการโฆษณา
              </p>
            </li>
            <li>
              <p>
                วัตถุที่จัดเก็บอยู่ภายในเครื่อง
                บริการของเราอาจใช้วัตถุที่จัดเก็บไว้ภายในเครื่อง (“LSOs”)
                และเทคโนโลยีการติดตามพื้นที่เก็บข้อมูลด้านลูกค้า
                ในบางสถานการณ์ซึ่งช่วยให้ผู้ใช้ได้รับประสบการณ์ที่ดียิ่งขึ้น
                เช่น จดจําการตั้งค่า การตั้งค่า
                และการใช้งานที่คล้ายกับคุกกี้ของเบราว์เซอร์
                หรือเพื่อกําหนดเป้าหมายหรือช่วย พันธมิตรในการวางเป้าโฆษณา
                วิเคราะห์ประสิทธิภาพโฆษณา หรือทําการวิเคราะห์ข้อมูลผู้ใช้
                เว็บไซต์ หรือการวิเคราะห์ตลาด สําหรับ LSOs ใช้โดย Adob Flash
                คุณสามารถเข้าถึงเครื่องมือการจัดการ Flash จากเว็บไซต์ของ Adob.
                นอกจากนี้เบราว์เซอร์บางเบราว์เซอร์
                แต่ไม่ใช่เบราว์เซอร์ทั้งหมดให้ความสามารถในการลบ LSOs
                ภายในการตั้งค่าคุกกี้และความเป็นส่วนตัว
              </p>
            </li>
            <li>
              <p>
                การปิดใช้งานคุกกี้
                เว็บเบราว์เซอร์ส่วนใหญ่จะถูกตั้งค่าให้ยอมรับคุกกี้
                คุณอาจตั้งค่าเบราว์เซอร์ให้เตือนคุณก่อนที่จะยอมรับคุกกี้บางอย่างหรือปฏิเสธคุกกี้บางอย่าง
                อย่างไรก็ตาม หากคุณปิดใช้งานการใช้คุกกี้ในเว็บเบราว์เซอร์ของคุณ
                เราอาจทํางานร่วมกับบริษัทภายนอกบางแห่งที่ใช้เทคนิคอื่นนอกเหนือจากคุกกี้
                HTTP เพื่อจดจําคอมพิวเตอร์หรืออุปกรณ์ของคุณ
                และ/หรือเพื่อรวบรวมและบันทึกข้อมูลเกี่ยวกับกิจกรรมการท่องเว็บของคุณ
                รวมถึงข้อมูลที่รวมเข้ากับบริการของเรา
                โปรดทราบว่าเว็บเบราว์เซอร์ของคุณอาจไม่อนุญาตให้คุณปิดกั้นการใช้เทคนิคเหล่านี้และการตั้งค่าเบราว์เซอร์ที่บล็อกคุกกี้ทั่วไปอาจไม่มีผลต่อเทคนิคดังกล่าว
                หากต้องการเรียนรู้เพิ่มเติมเกี่ยวกับการโฆษณาตามความสนใจหรือเลือกไม่รับโฆษณาประเภทนี้โดยบุคคลที่สามที่เป็นสมาชิกของ
                DAA โปรแกรมยกเลิกการเลือก โปรดไปที่ aboutads .info
              </p>
            </li>
            <li>
              <p>
                เว็บบีคอน เราและคู่ค้าของเราอาจใช้ “เว็บบีคอน” หรือ GIF
                ที่ชัดเจน หรือเทคโนโลยีที่คล้ายกัน
                ซึ่งเป็นโค้ดขนาดเล็กที่วางอยู่บนบริการหรือในอีเมล
                เพื่อตรวจสอบพฤติกรรมและรวบรวมข้อมูลเกี่ยวกับผู้เข้าชมที่ดูบริการหรืออีเมล
                ตัวอย่างเช่น
                เว็บบีคอนอาจใช้เพื่อนับผู้ใช้ที่เข้าชมหน้าเว็บหรือเพื่อส่งคุกกี้ไปยังเบราว์เซอร์ของผู้เข้าชมที่ดูบริการนั้น
                เว็บบีคอนอาจใช้เพื่อให้ข้อมูลเกี่ยวกับประสิทธิภาพของแคมเปญอีเมลของเรา
                (เช่น อัตราการเปิด การคลิก ไปข้างหน้า เป็นต้น)
              </p>
            </li>
            <li>
              <p>
                การใช้ตัวระบุอุปกรณ์เคลื่อนที่และ SDKในบางครั้ง
                เราอาจใช้หรือเป็นพาร์ทเนอร์กับผู้เผยแพร่หรือแพลตฟอร์มนักพัฒนาซอฟต์แวร์ผู้เผยแพร่โฆษณาหรือนักพัฒนาแอปที่ใช้
                ชุดพัฒนาซอฟต์แวร์สําหรับอุปกรณ์เคลื่อนที่ (“SDKs”)
                เพื่อเก็บข้อมูล เช่น ตัวระบุอุปกรณ์เคลื่อนที่ (เช่น IDFAs
                และรหัสโฆษณา Android)
                และข้อมูลที่เกี่ยวข้องกับวิธีที่อุปกรณ์เคลื่อนที่โต้ตอบกับไซต์ของเราและไซต์ต่างๆ
                ของเรา SDK
                ดังกล่าวให้รหัสคอมพิวเตอร์ที่นักพัฒนาแอปสามารถรวมไว้ในแอปของตนเพื่อให้โฆษณาสามารถแสดง
                เราอาจใช้เทคโนโลยีนี้เพื่อส่งมอบหรือช่วยคู่ค้าของเราและบุคคลที่สามอื่นๆ
                เพื่อแสดงโฆษณาบางอย่างผ่านแอปพลิเคชันและเบราว์เซอร์บนอุปกรณ์เคลื่อนที่โดยอิงตามข้อมูลที่เกี่ยวข้องกับอุปกรณ์เคลื่อนที่ของคุณ
                หากคุณต้องการเลือกที่จะไม่รับโฆษณาที่ปรับให้เหมาะกับคุณด้วยวิธีนี้บนอุปกรณ์เคลื่อนที่
                โปรดทําตามคําแนะนําในส่วน “ตัวเลือกโฆษณาของคุณ” ด้านล่าง
                เมื่อไปที่บริการ ไม่ว่าจะเป็นผู้ใช้ที่ลงทะเบียนแล้ว หรือมิฉะนั้น
                คุณรับทราบ
                และยอมรับว่าคุณให้ความยินยอมในการติดตามกิจกรรมและการใช้บริการของคุณผ่านทางเทคโนโลยีที่อธิบายไว้ข้างต้น
                รวมถึงเทคโนโลยีที่คล้ายคลึงกันซึ่งพัฒนาขึ้นในอนาคต
                และเราอาจใช้เทคโนโลยีการติดตามดังกล่าวในอีเมลที่เราส่งถึงคุณ
                พันธมิตรของเราและบุคคลที่สามอาจกําหนดและเข้าถึงเทคโนโลยีการติดตามของตนเองเมื่อคุณเยี่ยมชมบริการของเราและพวกเขาจะสามารถเข้าถึงข้อมูลเกี่ยวกับคุณและกิจกรรมออนไลน์ของคุณเมื่อเวลาผ่านไปและในเว็บไซต์หรือแอปพลิเคชันที่แตกต่างกันเมื่อคุณใช้บริการ
                การใช้เทคโนโลยีการติดตามดังกล่าวไม่ได้อยู่ในการควบคุมของเราและอยู่ภายใต้นโยบายความเป็นส่วนตัวของตนเอง
              </p>
            </li>
          </ol>
          <p>ข้อมูลที่สําคัญเกี่ยวกับความเป็นส่วนตัวของคุณ</p>

          <ol>
            <li>
              <p>
                บริการที่เชื่อมโยง<br />
                บางบริการมีลิงก์ไปยังหรือรวมกับบริการอื่น เช่น Facebook,
                Twitter, LinkedIn และบริการสื่ออื่นๆ และแพลตฟอร์มต่างๆ
                ที่ปฏิบัติข้อมูลอาจแตกต่างจากบริการของเรา
                ผู้เข้าชมควรปรึกษาประกาศเกี่ยวกับความเป็นส่วนตัวของบริการอื่นๆ
                เหล่านี้เนื่องจากเราไม่มีการควบคุมข้อมูลที่ส่งไปหรือเก็บรวบรวมโดยบุคคลที่สามเหล่านี้
              </p>
            </li>
            <li>
              <p>
                ความปลอดภัยของข้อมูลเราได้วางในขั้นตอนทางกายภาพอิเล็กทรอนิกส์และการบริหารจัดการที่ออกแบบมาเพื่อช่วยป้องกันการเข้าถึงโดยไม่ได้รับอนุญาตเพื่อรักษาความปลอดภัยของข้อมูลและใช้ข้อมูลที่เราเก็บรวบรวมออนไลน์
                อย่างถูกต้อง
                การป้องกันเหล่านี้แตกต่างกันไปขึ้นอยู่กับความไวของข้อมูลที่เรารวบรวมและจัดเก็บ
                แม้ว่าเราจะใช้มาตรการที่เหมาะสมเพื่อป้องกันการเปิดเผยข้อมูลที่ไม่ได้รับอนุญาต
                แต่เราไม่สามารถมั่นใจได้ว่าจะไม่มีการเปิดเผยเปลี่ยนแปลงหรือทําลายในลักษณะที่ไม่สอดคล้องกับนโยบายความเป็นส่วนตัวนี้
              </p>
            </li>
            <li>
              <p>
                วิธีที่คุณสามารถเข้าถึงหรือแก้ไขการเข้าถึงข้อมูลส่วนบุคคลบางอย่างที่ถูกรวบรวมจากบริการของเราและเราเก็บรักษาไว้อาจพร้อมใช้งานสําหรับคุณ
                ตัวอย่างเช่น
                หากคุณสร้างบัญชีที่มีการป้องกันด้วยรหัสผ่านภายในบริการของเรา
                กรุณาใส่ข้อมูลการลงทะเบียนของคุณสําหรับบริการเช่นชื่อนามสกุลและที่อยู่อีเมลในคําขอ
                เราอาจขอให้คุณให้ข้อมูลเพิ่มเติมเพื่อวัตถุประสงค์ในการตรวจสอบข้อมูลประจําตัว
                หรือเพื่อยืนยันว่าคุณอยู่ในบัญชีอีเมลที่เกี่ยวข้อง
                อีเมลฝ่ายสนับสนุนลูกค้า:
                <a href="mailto:support@mattresscity.co.th"
                  >support@mattresscity.co.th</a
                >
              </p>
            </li>
            <li>
              <p>
                วิธีการติดต่อเรา /การเลือกไม่รับการโฆษณา
                หากคุณมีคําถามหรือข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัวออนไลน์สําหรับบริการนี้หรือการใช้งานหรือหากคุณต้องการยกเลิกการแบ่งปันข้อมูลส่วนบุคคลของคุณกับบุคคลที่สามที่ไม่เกี่ยวข้องเพื่อกับวัตถุประสงค์ทางการตลาดโดยตรงของบุคคลภายนอกคุณสามารถติดต่อเราได้ตามที่อยู่อีเมล์ข้างต้น
                และแจ้งว่าต้องการให้เรายกเลิกการแบ่งปันข้อมูลดังกล่าว
                เราอาจขอให้คุณให้ข้อมูลเพิ่มเติมเพื่อวัตถุประสงค์ในการตรวจสอบข้อมูลประจําตัว
                หรือเพื่อยืนยันว่าคุณอยู่ในบัญชีอีเมลที่เกี่ยวข้อง
                หากคุณได้ลงทะเบียนเพื่อรับอีเมลของเราและไม่ต้องการรับข้อมูลทางการตลาดจากบริการนี้
                ให้ทําตามคําแนะนํา “ยกเลิกการสมัคร”
                ที่ให้ไว้ในอีเมลทางการตลาดที่คุณได้รับจากบริการนี้
              </p>
            </li>
            <li>
              <p>
                เว็บไซต์นี้ได้รับการคุ้มครองโดย reCAPTCHA และ<a
                  href="https://policies.google.com/privacy"
                  >นโยบายความเป็นส่วนตัว</a
                >ของ Googleและเงื่อนไข<a
                  href="https://policies.google.com/terms"
                  >การใช้บริการ</a
                >มีผลบังคับใช้
              </p>
            </li>
          </ol>
          <p>V. การปรับปรุงและวันที่มีผลบังคับ</p>

          <p>
            เราอาจปรับปรุงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว
            เราจะแจ้งให้คุณทราบเกี่ยวกับการเปลี่ยนแปลงเนื้อหาโดยการส่งข้อความอีเมลไปยังที่อยู่อีเมลที่คุณให้ไว้กับเราครั้งล่าสุดหรือโดยการโพสต์ประกาศในบริการของเราอย่างเด่นชัด
            เราขอแนะนําให้คุณตรวจสอบและทบทวนนโยบายนี้เป็นระยะๆ
            เพื่อที่คุณจะทราบว่าข้อมูลที่เราเก็บรวบรวม
          </p>

          <p>VI. ข้อมูลการติดต่อ</p>

          <p>หากมีข้อสงสัยเกี่ยวกับความเป็นส่วนตัวของลูกค้ากรุณาติดต่อ :</p>

          <ul>
            <li><p>บริษัท แมทเทรสซิตี้ จำกัด</p></li>
          </ul>

          <p>
            ที่อยู่: 298/64-65 ถนนพิษณุโลก ซอย 3 ดุสิต กรุงเทพ 10330 ประเทศไทย
          </p>

          <p>
            อีเมล:
            <a href="mailto:support@mattresscity.co.th"
              >support@mattresscity.co.th</a
            >
          </p>

          <p>หมายเลขโทรศัพท์: (+66) 97-9569917</p>

          <p>
            นโยบายความเป็นส่วนตัวที่โพสต์บนบริการนี้ได้รับการอัปเดตเมื่อวันที่ 1
            มิถุนายน 2019
          </p>

          <p>
            ขอขอบคุณสำหรับการติดต่อเข้ามาที่โลตัสเบดดิ้ง เราเป็นผู้ค้าปลีกที่นอน
          </p>

          <br />
        </v-card-text>
        <v-divider></v-divider>
        <v-card-actions>
          <v-layout justify-center>
            <v-btn color="black" class="white--text" @click="closePDPA('pdpa')">
              ไม่ยอมรับ
            </v-btn>
          </v-layout>
          <v-layout justify-center>
            <v-btn color="red" class="white--text" @click="confirm('pdpa')">
              ยอมรับ
            </v-btn>
          </v-layout>
        </v-card-actions>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
export default {
  props: ["showPDPA"],
  methods: {
    closePDPA(text) {
      this.$emit("next", { type: text });
    },
    confirm(text) {
      this.$emit("submit", { type: text });
    },
  },
};
</script>

<style>
</style>
