<template>
  <v-row justify="center">
    <v-dialog v-model="showPDPA" scrollable persistent max-width="500px">
      <v-card>
        <v-layout justify-center>
          <v-card-title style="color: #018657">ข้อตกลงและเงื่อนไข</v-card-title>
        </v-layout>
        <v-card-text style="height: 500px" class="text-left"
          >    <p>ข้อตกลงและเงื่อนไขของผู้ใช้งาน <strong>KATO MANGO VOTE</strong></p>
            <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;โปรดอ่านข้อตกลงและเงื่อนไขลุ้นรับของรางวัลใช้งาน
                ผ่านแอปพลิเคชันนี้ ("ข้อตกลงและเงื่อนไข")
                อย่างระมัดระวังเนื่องจากข้อตกลงและเงื่อนไขนี้ระบุถึงข้อมูลสำคัญเกี่ยวกับสิทธิและหน้าที่ต่าง ๆ ของท่าน
                รวมถึงข้อจำกัดและข้อยกเว้นต่าง ๆ ซึ่งมีผลในการทำธุรกรรมและกิจกรรมทั้งหมดบนแอปพลิเคชัน</p>
            <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; การที่ท่านสมัครใช้บริการ และ/หรือ ใช้บริการใดๆผ่าน web app
                microsite หรือโดยการเลือก "ตกลง" เพื่อยอมรับตามข้อตกลงและเงื่อนไขนี้
                ถือว่าท่านได้รับทราบและรับรู้ถึงเนื้อหาของข้อตกลง และเงื่อนไขนี้โดยครบถ้วนสมบูรณ์แล้ว
                และตกลงที่จะถูกผูกพันโดยข้อตกลงและเงื่อนไขนี้ รวมถึงกฎระเบียบ และนโยบาย ที่อาจประกาศบนเว็บไซด์
                และแอปพลิเคชัน ซึ่งอาจมีการแก้ไขได้เป็นครั้งคราวโดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า นอกจากนี้
                บริการบางอย่างที่เสนอให้ผู้ใช้บริการได้ใช้งานผ่านเว็บไซต์หรือโปรแกรมอาจอยู่ภายใต้ข้อตกลงและเงื่อนไขเฉพาะเพิ่มเติม
                ซึ่งการใช้บริการของท่านจะต้องอยู่ภายใต้ข้อตกลงและเงื่อนไขเพิ่มเติมดังกล่าวด้วย
                โดยถือเป็นส่วนหนึ่งของข้อตกลงและเงื่อนไขนี้โดยการอ้างอิง
                นอกจากนี้ท่านตกลงว่าธุรกรรมอิเล็กทรอนิกส์/อินเทอร์เน็ต (Electronic/internet transactions)
                ที่ได้มีการประมวลผลและดำเนินการจนเสร็จสิ้นแล้วโดยผ่านทางเว็บไซต์หรือโปรแกรมนี้มีผลบังคับใช้ได้อย่างสมบูรณ์ตามกฎหมายและผูกพันคู่สัญญาตามพระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์
                พุทธศักราช 2544 ของประเทศไทย</p>
            <p>&nbsp;</p>
            <p>1. นิยามศัพท์</p>
            <p>1.1 "สัญญา" (Agreement) หรือ "ข้อตกลงและเงื่อนไข" (Terms and Conditions) หมายถึงข้อตกลงและเงื่อนไขนี้</p>
            <p>1.2 "โฆษณา" (Advertising) หรือ "การโฆษณา" (Ads) หมายถึง
                โฆษณาที่สร้างโดยผู้สนับสนุนเพื่อส่งเสริมการขายหรือเพื่อกิจกรรมการตลาดต่างๆของสินค้าหรือบริการของผู้สนับสนุนโดยผ่านเว็บไซต์หรือ
            </p>
            <p>1.3 KATO MANGO VOTE หมายถึง แอปพลิเคชันที่ถูกสร้างขึ้นบนระบบปฏิบัติการแอนดรอยด์ (Android)
                ระบบปฏิบัติไอโอเอส (iOS) และ ผ่านช่องทางระบบคอมพิวเตอร์ หรือระบบปฏิบัติการอื่นๆที่อาจพัฒนาขึ้นในอนาคต
                เป็นสื่อกลางให้ผู้สนับสนุนประกาศแคมเปญกิจกรรมการตลาดต่างๆ กำหนดสิทธิ์การลุ้นรางวัล
                กำหนดเงื่อนไขและข้อกำหนด รวมถึงการโฆษณาต่างๆ ให้กับผู้ใช้งาน (User)
                ที่ยินยอมตกลงสมัครเป็นสมาชิก&nbsp;&nbsp;</p>
            <p>1.4 "แคมเปญ" (Campaign) หมายถึง
                กิจกรรมส่งเสริมการตลาดที่ผู้สนับสนุนประกาศลงบนเว็บไซต์หรือโปรแกรมสำหรับให้ผู้ใช้งานร่วมกิจกรรม
                หรือแลกรับของรางวัลได้ภายในระยะเวลาที่ผู้สนับสนุนกำหนดภายใต้ข้อตกลงและเงื่อนไขของแต่ละแคมเปญ</p>
            <p>1.5 "ผู้สนับสนุน" (Sponsor) หมายถึง นิติบุคคลหรือบุคคลธรรมดาที่เป็นผู้สนับสนุนรางวัล เป็นผู้สร้าง
                และประกาศแคมเปญกิจกรรมการตลาดต่างๆบน web app microsite KATO MANGO VOTE
                ผู้ใช้งานที่ตกลงยอมรับเงื่อนไขและข้อกำหนด การลุ้นรางวัล อันได้แก่สินค้า (Product) บริการ (Service)
                บัตรกำนัล (Voucher) คูปอง (Coupon) และ ของรางวัล เป็นต้น</p>
            <p>1.6 "ระบบ" (System) หมายถึง ฐานข้อมูลและโปรแกรมการทำงานของแอปพลิเคชัน KATO MANGO VOTE</p>
            <p>1.7 "ธุรกรรม" (Transaction) หมายถึง การที่ผู้ใช้งาน (User) ทำรายการกรอกส่งรหัสใต้ฝาลุ้นรับรางวัลบน web
                app microsite KATO MANGO VOTE บนอุปกรณ์พกพา (Mobile Device) หรือ ผ่านคอมพิวเตอร์</p>
            <p>1.8 "ผู้ใช้งาน" (User) หมายถึงท่านผู้ซึ่งเข้าชมและใช้งาน รวมไปถึงการร่วมกิจกรรมต่างๆบนแอปพลิเคชัน (KATO
                MANGO VOTE)</p>
            <p>1.9 สิทธิ์ หมายถึง สิทธิ์ที่ KATO MANGO VOTE เป็นผู้กำหนดในการได้มา เพื่อใช้ร่วมกิจกรรม ลุ้นรางวัล สินค้า
                บริการ บัตรกำนัล คูปอง หรือส่วนลดจากแคมเปญที่ประกาศไว้ &nbsp;</p>
            <p>&nbsp;</p>
            <p>2. บททั่วไป</p>
            <p>2.1 เอกสารนี้เป็นสัญญาตามกฎหมายระหว่างผู้ใช้งานกับผู้สนับสนุน</p>
            <p>2.2 ผู้ใช้งานตกลงว่าเนื้อหาทั้งหมดที่ผู้ใช้งานเข้าถึงได้โดยการใช้งานบน web app microsite
                นั้นถือเป็นความเสี่ยงภัยของผู้ใช้งานเอง
                และผู้ใช้งานจะต้องรับผิดชอบในความเสียหายหรือสูญหายใดๆที่เกิดขึ้นกับผู้ใช้งานหรือบุคคลอื่นอันเนื่องมาจากเนื้อหาดังกล่าว
                อนึ่ง เพื่อวัตถุประสงค์ของข้อตกลงและเงื่อนไขนี้ คำว่า "เนื้อหา"
                ให้รวมถึงแต่ไม่จำกัดเพียงข้อมูลเกี่ยวกับสถานที่อยู่ วีดีโอ ข้อความเสียง ข้อวิจารณ์ ข้อมูล ข้อความ รูปภาพ
                โปรแกรมต่างๆ ที่ใช้กับคอมพิวเตอร์ สคริปท์ กราฟฟิก และสิ่งที่ใช้ระหว่างกันอื่นใดที่ KATO MANGO VOTE
                เป็นผู้สร้างขึ้น จัดหา หรือทำให้เข้าถึงได้ผ่านทางบริการ</p>
            <p>2.3 เนื้อหา หรือกิจกรรมใดๆบนแอปพลิเคชัน KATO MANGO VOTE อาจมีการโฆษณา
                หรือจัดให้มีการร่วมกิจกรรมกับผู้ใช้งานผ่านทางโปรแกรมของบุคคลที่สาม เช่นเฟซบุ๊ก หรือช่องทางอื่นๆได้
                ในกรณีที่เป็นการใช้งานโดยผ่านเว็บไซต์หรือโปรแกรมของบุคคลที่สาม
                ผู้ใช้งานอาจถูกร้องขอให้ตกลงและปฏิบัติตามข้อตกลงและเงื่อนไขในการใช้งานของบุคคลที่สามดังกล่าว</p>
            <p>&nbsp;</p>
            <p>3. บัญชี: การลงทะเบียนและการยกเลิก</p>
            <p>3.1 ผู้ใช้งานจะต้องสมัครสมาชิกเพื่อที่จะมีสิทธิลุ้นรางวัล และมีสถานะในการลุ้นรางวัลที่ประกาศไว้บน web app
                microsite KATO MANGO VOTE
                และเพื่อใช้บริการบางประเภทที่มีไว้สำหรับผู้ใช้งานที่สมัครสมาชิกแล้วเท่านั้น&nbsp;&nbsp;</p>
            <p>3.2 ในการสมัครสมาชิกเป็นผู้ใช้งาน ผู้ใช้งานจะต้องให้ข้อมูล ชื่อ-นามสกุล อีเมล์
                หมายเลขโทรศัพท์ที่ยังใช้งานได้ จังหวัดที่อยู่ หรือข้อมูลส่วนตัวอื่นๆที่แอปพลิเคชันกำหนด ทั้งนี้
                โปรดดูรายละเอียดเพิ่มเติมในหัวข้อ นโยบายความเป็นส่วนตัว</p>
            <p>3.3 ผู้ใช้งานจะต้องสมัครลงทะเบียนร่วมกิจกรรม KATO MANGO VOTE
                &nbsp;กรอกข้อมูลส่วนตัวที่ใช้ในการสมัครเพื่อร่วมกิจกรรมส่งรหัสใต้ฝาใน web app microsite KATO MANGO VOTE
                โดยต้องเป็นข้อมูลส่วนตัวจริง และข้อมูลการติดต่อที่ยังใช้งานอยู่ในปัจจุบันเท่านั้นทั้งนี้ เพื่อให้ KATO
                MANGO VOTE หรือผู้สนับสนุน สามารถตรวจสอบยืนยันตัวบุคคลผู้ใช้งานในกรณีแลกรับของรางวัลต่างๆได้
                หากผู้ใช้งานสมัครสมาชิกโดยใช้ข้อมูลของบุคคลอื่น ผู้สนับสนุนมีสิทธิ์ในการขอตรวจสอบหลักฐานประกอบเพิ่มเติม
                เพื่อยืนยันตัวตนว่าเป็นของเจ้าของข้อมูลจริง จริง หากไม่สามารถตรวจสอบข้อมูลได้
                ผู้สนับสนุนขอสงวนสิทธิ์ในการมอบของรางวัลแก่ผู้ใช้งาน และไม่สามารถแลกเปลี่ยนเป็นพอยท์ หรือเงินสดได้</p>
            <p>3.4 ผู้สนับสนุนขอ สงวนสิทธิ์ที่จะปฏิเสธการสมัครสมาชิก
                หรือยกเลิกบัญชีของสมาชิกเมื่อใดก็ได้โดยไม่ต้องมีการแจ้งล่วงหน้า
                ในกรณีที่สามารถตรวจสอบได้ว่าผู้ใช้งานบัญชีดังกล่าวทำการทุจริต ส่อเจตนาทุจริต
                หรือทำผิดกฏที่ประกาศไว้ในเงื่อนไขและข้อตกลงของแต่ละแคมเปญ
                โดยพอยท์ที่ได้รับหรือสะสมไว้ของผู้ใช้งานจะถูกยกเลิกโดยอัตโนมัติ
                และจะไม่มีการชดเชยคืนให้แก่ผู้ใช้งานไม่ว่าในรูปแบบใดๆทั้งสิ้น</p>
            <p>3.5 บัญชีที่ลงทะเบียนร่วมกิจกรรม KATO MANGO VOTE ของผู้ใช้งานอาจถูกยกเลิกหาก
                ผู้สนับสนุนพบว่าผู้ใช้งานประการหรือลงข้อความในลักษณะที่เป็นการละเมิดหรือก่อให้เกิดความเสียหายต่อสถาบันชาติ
                ศาสนาหรือพระมหากษัตริย์</p>
            <p>&nbsp;</p>
            <p>4. การได้รับสิทธิ์ลุ้นรางวัลรางวัล</p>
            <p>4.1 การได้รับสิทธิ์&nbsp;&nbsp;</p>
            <p>4.1.1 ผู้ใช้งานจะได้รับสิทธิ์จากการพิมพ์รหัสใต้ฝาที่ได้จากการซื้อ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว
                รสข้าวเหนียวมะม่วงอกร่อง หรือ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว รสมะม่วงแรดแซสซี่ หรือ กาโตะ
                น้ำผลไม้ผสมวุ้นมะพร้าวรส มะม่วงจี๊ดพริกเกลือ และการร่วมกิจกรรมต่างๆบนแอปพลิเคชัน KATO MANGO VOTE
                รวมไปถึงกิจกรรมอื่นๆที่ผู้สนับสนุนเป็นผู้กำหนดขึ้นโดยผู้สนับสนุนจะเป็นผู้แจ้งกติกาการได้รับสิทธิ์ให้ทราบผ่านช่องทางต่างๆของผู้สนับสนุนเอง
                หรือผ่านช่องทางหรือเวบใซต์ของบุคคลที่สามก็ได้ทั้งสิ้น</p>
            <p>4.1.2 สิทธิ์ที่ผู้ใช้งานได้รับสามารถนำไปใช้ลุ้นรับรางวัล ภายใต้เงื่อนไข
                และกำหนดระยะเวลาของแต่ละแคมเปญที่มีการประกาศให้ทราบบนแอปพลิเคชันเท่านั้นผู้ใช้งานไม่สามารถโอนสิทธิ์ให้แก่ผู้ใช้งานท่านอื่น
                และไม่สามารถแลกเปลี่ยนสิทธิ์เป็นเงินสดได้ ไม่ว่ากรณีใดๆ</p>
            <p>4.1.3 สิทธิ์ที่ได้รับจะมีอายุถึงวันที่ 30 เมษายน 2564 เวลา 24.00 น.
                หากยังมีสิทธิ์สะสมอยู่ในบัญชีของผู้ใช้งานหลังวันที่ดังกล่าว ผู้สนับสนุนขอสงวนสิทธิ์ในการลบ
                หรือยกเลิกสิทธิ์ออกจากระบบ KATO MANGO VOTE โดยไม่จำเป็นต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า
                หรือทราบถึงจำนวนสิทธิ์ที่จะหมดอายุลง</p>
            <p>4.1.4 ในกรณีที่เกิดการล้มเหลวของระบบอันเป็นผลทำให้ฐานข้อมูล หรือสิทธิ์ที่สะสมไว้ของผู้ใช้งานสูญหาย
                ผู้สนับสนุนขอสงวนสิทธิ์ตัดสินการใดๆที่เกี่ยวกับจำนวนสิทธิ์ และการให้สิทธิ์ประโยชน์ต่างๆบนแอปพลิเคชัน
                KATO MANGO VOTE และผู้ใช้งานตกลงยอมรับคำตัดสินดังกล่าวโดยไม่มีข้อโต้แย้งใดๆทั้งสิ้น</p>
            <p>4.1.5 ผู้สนับสนุนมีสิทธิในการปรับเปลี่ยนอัตรา
                หรือจำนวนสิทธิ์ที่ผู้ใช้งานจะได้รับจากการพิมพ์รหัสใต้ฝาจากการซื้อ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว
                ข้าวเหนียวมะม่วงอกร่อง หรือ กาโตะ น้ำผลไม้ผสมวุ้นมะพร้าว มะม่วงแรดแซสซี่ และ กาโตะ
                น้ำผลไม้ผสมวุ้นมะพร้าว มะม่วงจี๊ดพริกเกลือ และการร่วมกิจกรรมต่างได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
            <p>4.1.6 ผู้สนับสนุน ขอสงวนสิทธิ์ในการรวมสิทธิ์ หรือ ถ่ายโอนสิทธิ์ หรือ
                เปลี่ยนแปลงจำนวนสิทธิ์จากบัญชีผู้ใช้งานหนึ่ง ไปอีกบัญชีผู้ใช้งานหนึ่ง ไม่ว่ากรณีใดก็ตาม</p>
            <p>4.1.7 ผู้ใช้งานที่ทำการสะสมสิทธิ์เข้าบัญชีผู้ใช้งาน ไม่สามารถแลกเปลี่ยนเป็นเงินสด หรือของรางวัลอื่นได้
                และไม่สามารถโอนสิทธิในการโอนจำนวนสิทธิ์ให้แก่บุคคลอื่นได้</p>
            <p>4.2 แคมเปญและการลุ้นรางวัล</p>
            <p>4.2.1 ผู้สนับสนุนจะเป็นผู้สร้างและประกาศแคมเปญลงบนแอปพลิเคชัน KATO MANGO VOTE
                เพื่อให้ผู้ใช้งานลุ้นรางวัลตามที่ผู้สนับสนุนกำหนด ทั้งนี้แคมเปญแต่ละแคมเปญอาจมีข้อกำหนดหรือเงื่อนไขเฉพาะ
                ดังนั้นจึงเป็นหน้าที่ของผู้ใช้งานในการศึกษาและทำความเข้าใจข้อกำหนดและเงื่อนไขเฉพาะดังกล่าว
                โดยจะไม่รับผิดชอบหากผู้ใช้งานเข้าใจผิดเกี่ยวกับเนื้อหาหรือข้อกำหนดหรือเงื่อนไขของแคมเปญ</p>
            <p>4.2.2 เมื่อผู้ใช้งานส่งคำขอ และตกลงยอมรับข้อกำหนดและเงื่อนไขการแลกรับรางวัลแล้ว
                จะไม่สามารถยกเลิกหรือเปลี่ยนแปลงได้
                และจะไม่มีการคืนคะแนนให้ไม่ว่าในกรณีหรือด้วยเหตุผลใดๆและขอสงวนสิทธิ์ในการปรับเปลี่ยน
                หรือเปลี่ยนแปลงจำนวนสิทธิ์ในการลุ้นของรางวัล หรือสิทธิ์ที่ใช้ในการเข้าร่วมกิจกรรมต่างๆบน web app
                microsite KATO MANGO VOTE โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
            <p>4.2.3 ผู้สนับสนุนมีสิทธิที่จะยกเลิกคำขอแลกรับรางวัลของผู้ใช้งานได้ไม่ว่าในเวลาใดๆ
                อันเนื่องมาจากความผิดพลาดอันเป็นผลใหข้อมูลของแคมเปญถูกแสดงผิดไป ในกรณีการยกเลิกคำขอแลกรับรางวัลดังกล่าว
                ผู้สนับสนุนจะคืนคะแนนให้แก่ผู้ใช้งานเต็มจำนวน ทั้งนี้จะไม่มีการคืนให้เป็นตัวเงินไม่ว่าในกรณีใดๆ</p>
            <p>4.3 การจับแจกและ จัดส่งรางวัล</p>
            <p>4.3.1 เมื่อระบบได้รับคำยืนยันการกรอกรหัสลุ้นรางวัล
                ระบบจะทำการเก็บข้อมูลที่ลูกค้ากรอกรหัสเมือกิจกรรมสิ้นสุดและมีการจับรางวัลแล้วทีมงานจะติดต่อผู้โชคดีเพื่อนำส่งของรางวัล
                โดยรางวัลจะถูกจัดส่งให้แก่ผู้ใช้งานเฉพาะที่อยู่ภายในประเทศไทยเท่านั้น</p>
            <p>4.3.2 ผู้สนับสนุนจะไม่รับประกันคุณภาพ ความปลอดภัย หรือคุณลักษณะใดๆผลิตภัณฑ์ หรือสินค้าที่มาจากบุคคลที่สาม
                ที่ผู้ใช้งานแลกรับ เนื่องจากคุณภาพ ความปลอดภัย หรือคุณลักษณะใดๆของผลิตภัณฑ์
                หรือสินค้าดังกล่าวเป็นไปตามมาตรฐานที่บุคคลที่สามแจ้งไว้หากผลิตภัณฑ์ หรือสินค้าเกิดชำรุดบกพร่อง
                ผู้ใช้งานจะต้องติดต่อศูนย์บริการของบุคคลที่สามที่เป็นผู้ผลิต หรือผู้ให้บริการของผลิตภัณฑ์
                หรือสินค้านั้นๆเอง</p>
            <p>4.4 ภาษีอากร</p>
            <p>ธุรกรรมที่เกี่ยวเนื่องกับแคมเปญเป็นธุรกรรมโดยตรงระหว่างผู้สนับสนุนและผู้ใช้งานดังนั้น
                ผู้ใช้งานรับทราบและตกลงว่าการรับรางวัลดังกล่าวอาจอยู่ภายใต้บังคับของกฏหมายภาษีอากรที่เกี่ยวข้อง เช่น
                การหักภาษี ณ ที่จ่าย อากรแสตมป์ ภาษีมูลค่าเพิ่ม เป็นต้น</p>
            <p>4.4.1 ผู้ที่ได้รับรางวัลมูลค่าเกิน 1,000 บาท ต้องชำระภาษีหัก ณ ที่จ่าย 5% (ตามคำสั่งกรมสรรพกร ที่
                ทป.101/2544)</p>
            <p>&nbsp;</p>
            <p>5. นโยบายความเป็นส่วนตัว</p>
            <p>ผู้สนับสนุน เคารพในสิทธิความเป็นส่วนตัวของผู้ใช้งานทุกคน
                ข้อมูลส่วนตัวของท่านจะได้รับความปลอดภัยอย่างสูงสุดในการทำธุรกรรมใดๆบนแอปพลิเคชัน KATO MANGO VOTE
                ดังนั้นข้อมูลต่าง ๆ ของท่าน ที่ให้ไว้ผ่านแอปพลิเคชัน
                จะถูกนำไปใช้ตามวัตถุประสงค์ของกิจกรรมลูกค้าสัมพันธ์ของผู้สนับสนุนเท่านั้น ผู้สนับสนุน
                จะดำเนินการตามมาตรฐานที่เข้มงวดในการรักษาความปลอดภัย
                ตลอดจนป้องกันไม่ให้มีการนำข้อมูลไปใช้โดยไม่ได้รับอนุญาตจากท่านก่อน</p>
            <p>นโยบายความเป็นส่วนตัวตามที่ปรากฎด้านล่างนี้ ใช้บังคับกับบัญชีผู้ใช้งานและข้อมูลต่างๆของท่าน
                เพื่อให้ท่านทราบอย่างชัดเจนว่า ผู้สนับสนุน
                ใช้ข้อมูลของท่านอย่างไรและวิธีการที่ท่านสามารถใช้เพื่อปกป้องข้อมูลส่วนบุคคลของท่าน
                ตามที่ท่านได้ให้ไว้ผ่านแอปพลิเคชัน KATO MANGO VOTE นี้</p>
            <p>5.1 การเก็บรวบรวมข้อมูลส่วนบุคคล</p>
            <p>ระบบจะเก็บรวบรวมข้อมูลของท่านเพื่อการให้บริการที่ดีขึ้นแก่ผู้ใช้งานแอปพลิเคชัน KATO MANGO VOTE
                และเพื่อความสะดวกหรือเพื่อประโยชน์ในการใช้งานกับท่านมากที่สุด
                ระบบได้รวบรวมข้อมูลของท่านโดยใช้วิธีดังต่อไปนี้</p>
            <p>5.1.1 ข้อมูลที่ท่านให้เรา</p>
            <p>ผู้สนับสนุนจำเป็นต้องให้ผู้ใช้งานสมัครใช้สมาชิก KATO MANGO VOTE เพื่อความสะดวกแก่ผู้ใช้งานทุกราย
                ท่านจะต้องแจ้งข้อมูลส่วนบุคคลที่จำเป็นในแอปพลิเคชัน KATO MANGO VOTE อันได้แก่ ชื่อ-นามสกุล อีเมล์
                วันเดือนปีเกิด เพศ และ หมายเลขโทรศัพท์ เป็นต้น
                ในกรณีที่ผู้ใช้งานใช้สิทธิ์ลุ้นรับรางวัลภายใต้แคมเปญต่างๆของ KATO MANGO VOTE
                ผู้ใช้งานจะต้องยินยอมแจ้งข้อมูลส่วนตัวที่ผู้สนับสนุนร้องขอเพิ่มเติม
                หากผู้ใช้งานให้ข้อมูลตามที่ผู้สนับสนุนร้องขอไม่ครบถ้วน
                ผู้สนับสนุนขอสงวนสิทธิ์ในการจัดรับรางวัลดังกล่าวโดยไม่มีข้อยกเว้นใดๆ</p>
            <p>5.1.2 ข้อมูลอุปกรณ์</p>
            <p>ระบบจะรวบรวมข้อมูลเฉพาะของอุปกรณ์พกพา (Mobile Device) และ computer , Notebook
                ที่ผู้ใช้งานใช้สมัครสมาชิกในครั้งแรกด้วย เช่น รุ่นฮาร์ดแวร์ รุ่นระบบปฏิบัติการ ข้อมูลเครือข่าย เลข IMEI
                เป็นต้น</p>
            <p>5.1.3 ข้อมูลประวัติการใช้งาน</p>
            <p>เมื่อผู้ใช้งานทำกิจกรรมใดๆ เช่นการพิมพ์รหัสเพื่อลุ้นรางวัลต่างๆบน web app microsite KATO MANGO VOTE
                ระบบจะรวบรวมและจัดเก็บข้อมูลการใช้งานไว้อัตโนมัติ เช่น ข้อมูลที่ท่านค้นหา รายละเอียดการการโหวตสินค้า และ
                ประวัติการส่ง เป็นต้น</p>
            <p>5.1.4 ข้อมูลตำแหน่ง</p>
            <p>ระบบอาจรวบรวมและประมวลผลข้อมูลตำแหน่งที่อยู่ของผู้ใช้งาน โดยใช้เทคโนโลยีระบุตำแหน่ง
                เพื่อใช้เป็นข้อมูลในการนำเสนอกิจกรรม หรือแคมเปญใดๆของผู้สนับสนุน</p>
            <p>5.1.5 พื้นที่เก็บข้อมูลในตัวเครื่อง</p>
            <p>ระบบอาจรวบรวมและจัดเก็บข้อมูลส่วนตัว และข้อมูลการใช้งานอื่นๆของผู้ใช้งาน
                โดยใช้พื้นที่จัดเก็บข้อมูลเว็บเบราว์เซอร์ (รวมถึง HTML 5) และแคชข้อมูลของแอปพลิเคชัน</p>
            <p>5.1.6 คุกกี้ (Cookies) และ แคชไฟล์ (Cache File)</p>
            <p>&ldquo;คุกกี้&rdquo; คือไฟล์ข้อมูลเล็ก ๆ ที่ถูกส่งไปยังเครื่องอุปกรณ์พกพาของผู้ใช้งาน
                เพื่อเป็นการอนุญาตให้แอปพลิเคชัน KATO MANGO VOTE บันทึกข้อมูลเกี่ยวกับท่านในฐานะผู้ใช้งานของ KATO MANGO
                VOTE เมื่อท่านได้กลับเข้ามายังเวบแอปพลิเคชันของ KATO MANGO VOTE อีกครั้งโดยใช้โปรแกรมท่องอินเตอร์เน็ท
                (Web browser) และอุปกรณ์เครื่องเดิม ระบบจะส่ง &ldquo;คุกกี้&rdquo;
                ไปยังอุปกรร์ของท่านก็ต่อเมื่อท่านสมัครสมาชิกเพื่อใช้งานบัญชีของท่านที่ได้สมัครไว้กับ Kato Thailand
                &ldquo;คุกกี้&rdquo; เหล่านี้สามารถทำให้ระบบจดจำท่านในขณะที่ท่านเข้าใช้บริการในหน้าต่าง ๆ
                ภายในเว็บแอปพลิเคชัน Kato Thailand โดยไม่จำเป็นต้องระบุชื่อผู้ใช้งานและรหัสผ่านหลายครั้ง
                และเมื่อท่านลงชื่อออกจากระบบหรือปิดหน้า Web browser &ldquo;คุกกี้&rdquo; เหล่านี้จะสิ้นผลลง</p>
            <p>เว็บบราวเซอร์ (Web browser)
                หรือโปรแกรมบนอุปกรณ์พกพาที่ท่านใช้เชื่อมต่อกับเว็บไซต์หรือระบบอาจเก็บและบันทึก &ldquo;Cache File&rdquo;
                รวมถึงข้อมูลส่วนบุคคลของท่านไว้ ซึ่งแอปพลิเคชัน Kato Thailand ไม่มีส่วนในการควบคุมหรือเข้าถึง
                &ldquo;Cache File&rdquo; ดังกล่าวแต่อย่างใด</p>
            <p>5.2 วิธีการใช้ข้อมูลของผู้ใช้งาน</p>
            <p>5.2.1 ผู้สนับสนุนจะใช้ข้อมูลส่วนตัวของผู้ใช้งานเท่าที่จำเป็นในการติดต่อ ให้บริการ สำรวจความคิดเห็น
                ประชาสัมพันธ์ หรือให้ข้อมูลข่าวสารต่างๆที่เป็นประโยชน์กับผู้ใช้งาน
                รวมไปถึงการนำข้อมูลไปใช้ในการวิเคราะห์เชิงสถิติเพื่อปรับปรุง การทำกิจกรรมการตลาดในรูปแบบต่างๆ
                หรือกิจกรรมอื่นที่อยู่ภายใต้การดูแลของผู้สนับสนุนให้ดียิ่งขึ้น</p>
            <p>5.2.2 ผู้ใช้งานมีสิทธิในความเป็นส่วนตัวของข้อมูลของท่าน
                โดยผู้สนับสนุนจะไม่อนุญาตให้มีการเปิดเผยข้อมูลเกี่ยวกับบัญชีผู้สมัครลงทะเบียน ร่วมกิจกรรม KATO MANGO
                VOTE ของท่านให้กับบุคคลภายนอก นอกเหนือจากการได้รับอนุญาตจากผู้ใช้งานเท่านั้น</p>
            <p>5.2.3 ผู้สนับสนุนจะไม่นำข้อมูลส่วนตัวของผู้ใช้งานที่ให้ไว้บนแอปพลิเคชัน KATO MANGO VOTE
                ไปขายหรือเผยแพร่ให้กับบุคคลภายนอกโดยเด็ดขาด เว้นแต่จะได้รับอนุญาตจากผู้ใช้งานเท่านั้น</p>
            <p>5.2.4 แอปพลิเคชันอาจมีโฆษณาที่เชื่อมต่อ (Link) ไปยังเว็บไซต์อื่น ๆ
                ซึ่งอาจมีมาตรการหรือนโยบายเกี่ยวกับการคุ้มครองความเป็นส่วนตัวที่แตกต่างจากแอปพลิเคชัน KATO MANGO VOTE
                นี้ ท่านต้องตรวจสอบนโยบายความเป็นส่วนตัวของเว็บไซต์อื่นที่เชื่อมโยงนี้ด้วย
                ผู้สนับสนุนไม่สามารถรับรองข้อความ หรือการดำเนินการตามที่ได้มีการประกาศไว้ในเว็บไซต์อื่นได้
                และจะไม่รับผิดชอบใด ๆ หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการหรือดำเนินการใด ๆ
                ตามนโยบายความเป็นส่วนตัวที่ได้ประกาศไว้</p>
            <p>5.2.5 เมื่อผู้ใช้งานติดต่อขอความช่วยเหลือผ่านทาง web app microsite KATO MANGO VOTE
                ระบบจะเก็บบันทึกการติดต่อของท่าน เพื่อช่วยแก้ปัญหาใดๆ ตามที่ตรวจพบ
                และอาจใช้ที่อยู่อีเมลของท่านเพื่อแจ้งให้ท่านทราบถึงการแก้ปัญหาที่เกิดขึ้นหรือ
                แจ้งให้ทราบเกี่ยวกับการเปลี่ยนแปลงหรือการปรับปรุงใดๆไว้ล่วงหน้า</p>
            <p>5.2.6 KATO MANGO VOTE จะขอความยินยอมจากท่านก่อนใช้ข้อมูลเพื่อจุดประสงค์อื่น ๆ
                นอกเหนือจากที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้</p>
            <p>5.3 การเข้าถึงและเปลี่ยนแปลงข้อมูลส่วนตัว</p>
            <p>5.3.1 ผู้สนับสนุนอาจปฏิเสธคำขอซ้ำซ้อนอันเกินควรหรือต้องใช้ความพยายามทางเทคนิคมากเกินไป เช่น
                การพัฒนาระบบใหม่หรือเปลี่ยนหลักปฏิบัติพื้นฐานที่มีอยู่ เสี่ยงต่อข้อมูลส่วนบุคคลของผู้อื่น
                หรือไม่สามารถปฏิบัติได้จริง เช่น คำขอเกี่ยวกับข้อมูลที่อยู่ในระบบสำรอง</p>
            <p>5.3.2 เมื่อบัญชี KATO MANGO VOTE ของท่านถูกปิดแล้ว ระบบจะยังคงเก็บข้อมูลบัญชีของท่านไว้ในฐานข้อมูลของ
                KATO MANGO VOTE ต่อไปตามที่กฎหมายกำหนด เพื่อวัตถุประสงค์ในการตรวจสอบกรณีทุจริต
                และเป็นการป้องกันการปิดบัญชีเพื่อหลีกเลี่ยงการทุจริตโดยการปิดบัญชีเก่าและเปิดบัญชีใหม่ อย่างไรก็ตาม
                เมื่อบัญชีของท่านถูกปิดแล้ว ผู้สนับสนุนจะไม่ใช้ข้อมูลของท่านอีกต่อไป
                รวมทั้งจะไม่เปิดเผยข้อมูลของท่านให้แก่บุคคลอื่น ยกเว้นกรณีที่ใช้ในกระบวนการทางกฎหมายเท่านั้น</p>
            <p>5.4 การแบ่งปันข้อมูล</p>
            <p>5.4.1 ผู้สนับสนุนจะไม่แบ่งปันข้อมูลส่วนตัวของผู้ใช้งานกับบริษัท องค์กร และบุคคลภายนอก
                ยกเว้นในกรณีดังต่อไปนี้</p>
            <p>(1) เมื่อได้รับความยินยอมจากท่าน</p>
            <p>(2) สำหรับเหตุผลทางกฎหมาย</p>
            <p>5.4.2 ผู้สนับสนุนจะแบ่งปันข้อมูลส่วนตัวของผู้ใช้ให้กับบริษัท องค์กร หรือบุคคลภายนอก
                หากผู้สนับสนุนเชื่อโดยสุจริตว่าการเข้าถึง เข้าใช้ การเก็บรักษา
                หรือการเปิดเผยข้อมูลนั้นมีเหตุจำเป็นอันสมควรดังนี้</p>
            <p>(ก) เป็นไปตามกฎหมายที่เกี่ยวข้อง ระเบียบข้อบังคับ กระบวนการทางกฎหมาย หรือการร้องขอข้อมูลจากทางราชการ</p>
            <p>(ข) บังคับใช้ข้อกำหนดในการให้บริการที่เกี่ยวข้อง รวมถึงการตรวจสอบการละเมิดที่อาจเกิดขึ้น</p>
            <p>(ค) ตรวจจับ ป้องกัน หรือระบุการทุจริต ปัญหาด้านความปลอดภัยหรือด้านเทคนิค</p>
            <p>(ง) ป้องกันอันตรายต่อสิทธิ ทรัพย์สิน หรือความปลอดภัยผู้ใช้งานคนอื่นๆที่ใช้งานแอปพลิเคชัน&nbsp;&nbsp;
                หรือประชาชนตามที่กฎหมายกำหนดหรืออนุญาต</p>
            <p>5.5 การปรับปรุงนโยบายความเป็นส่วนตัว</p>
            <p>ผู้สนับสนุนอาจทำการปรับปรุงหรือแก้ไขนโยบายความเป็นส่วนตัวเป็นระยะ
                แต่จะไม่ลดทอนสิทธิของท่านภายใต้นโยบายความเป็นส่วนตัวนี้
                และจะเผยแพร่การเปลี่ยนแปลงเกี่ยวกับนโยบายส่วนตัวในแอปพลิเคชันนี้ และหากมีการเปลี่ยนแปลงสำคัญ
                ผู้สนับสนุนจะแจ้งให้ทราบล่วงหน้าอย่างชัดเจน
                ขอแนะนำให้ท่านอ่านนโยบายความเป็นส่วนตัวทุกครั้งที่เข้าชมหรือใช้หรือแลกรับรางวัล</p>
            <p>&nbsp;</p>
            <p>6. การใช้เว็บไซต์และโปรแกรม</p>
            <p>6.1 ผู้สนับสนุนจะใช้ความพยายามตามสมควรในการที่จะแก้ไขข้อผิดพลาดหรือข้อตกหล่นต่างๆ
                ให้เร็วที่สุดหลังจากได้รับการแจ้งถึงข้อผิดพลาดนั้นๆ
                อย่างไรก็ตามผู้สนับสนุนไม่รับประกันว่าแอปพลิเคชันจะปราศจากข้อผิดพลาดและ จะไม่รับผิดชอบในความผิดพลาด
                รวมถึงการสูญหายของพอยท์ของผู้ใช้งาน</p>
            <p>6.2
                ผู้สนับสนุนไม่รับประกันว่าโปรแกรมแอปพลิเคชันจะปราศจากไวรัสคอมพิวเตอร์หรือสิ่งอื่นใดที่อาจส่งผลอันตรายต่ออุปกรณ์พกพาของผู้ใช้งาน
            </p>
            <p>6.3 การเข้าถึงแอปพลิเคชันอาจถูกจำกัดในบางครั้งด้วยเหตุผลในการซ่อมบำรุง ซ่อมแซม
                หรือเพิ่มอุปกรณ์หรือบริการใหม่
                ผู้สนับสนุนจะใช้ความพยายามในการที่จะทำให้การเข้าถึงแอปพลิเคชันดังกล่าวกลับมาใช้งานได้ดังเดิมโดยเร็วที่สุด
                ทั้งนี้ KATO MANGO VOTE จะไม่รับผิดชอบในระบบการทำงานที่ขึ้นอยู่กับบราวเซอร์หรือโปรแกรมอื่นของบุคคลภายนอก
            </p>
            <p>6.4 ผู้สนับสนุนขอสงวนสิทธิ์ที่จะปิดกั้นการเข้าถึง และ/หรือ แก้ไขหรือลบสิ่งใดๆ
                ที่เห็นว่าอาจเป็นเหตุให้มีการผิดเงื่อนไขและข้อกำหนดของสัญญานี้</p>
            <p>6.5 การใช้ข้อมูลหรือสื่อใดๆ
                บนเว็บไซต์หรือโปรแกรมโดยผู้ใช้งานเป็นความเสี่ยงและเป็นความรับผิดชอบของผู้ใช้งานเองทั้งสิ้น</p>
            <p>6.6 ผู้ใช้งานสามารถเข้าถึงแอปพลิเคชัน KATO MANGO VOTE ได้จากการ<a href="https://katomangovote2022.com/"
                    target="_blank">https://katomangovote2022.com</a>&nbsp;หรือ Facebook : Kato Fruit n Fun
                จากช่องทางอื่นที่ผู้สนับสนุนได้มีการประชาสัมพันธ์เอาไว้
                ทั้งนี้ผู้สนับสนุนจะไม่รับผิดชอบต่อความเสียหายหรือความผิดปกติของอุปกรณ์พกพาของผู้ใช้งานอันเป็นผลมาจากการติดตั้งโปรแกรมลงบนอุปกรณ์พกพาของผู้ใช้งาน
            </p>
            <p>&nbsp;</p>
            <p>7. การโฆษณา</p>
            <p>7.1 ผู้สนับสนุนอาจแสดงสื่อโฆษณาในตำแหน่งต่างๆบนแอปพลิเคชัน ในระหว่างที่ผู้ใช้งานใช้บริการ</p>
            <p>7.2
                ผู้ใช้งานสามารถเลือกหรือกดเพื่อเข้าชมบริการที่มีการโฆษณาหรือไม่ก็ได้โดยอิสระตามแต่ที่ผู้ใช้งานจะพิจารณา
            </p>
            <p>7.3 จะไม่มีการใช้ข้อมูลส่วนตัว (เช่น ชื่อ ที่อยู่ อีเมล์ หรือหมายเลขโทรศัพท์) ในการแสดงข้อความโฆษณา
                แต่ทั้งนี้</p>
            <p>ผู้ลงโฆษณาที่เป็นบุคคลที่สามหรือบริษัทในเครืออาจะติดตั้งหรือจดจำ "cookie" บนเว็บบราวเซอร์ของผู้ใช้งาน
                (กรุณาดูในนโยบายความเป็นส่วนตัว) โดย "cookie"
                นี้จะไม่เก็บข้อมูลส่วนตัวของผู้ใช้งานหรือลิงค์เชื่อมต่อไปยังข้อมูลส่วนตัวของผู้ใช้งาน
                หากผู้ใช้งานต้องการข้อมูลเพิ่มเติมเกี่ยวกับวิธีปฏิบัติดังกล่าวและเลือกที่จะไม่ให้ใช้ข้อมูลดังกล่าวโดยบริษัทใดๆ
                กรุณาดูในนโยบายความเป็นส่วนตัวเกี่ยวกับเรื่องดังกล่าว</p>
            <p>&nbsp;</p>
            <p>8. การชดเชยและชดใช้ค่าเสียหาย</p>
            <p>ผู้ใช้งานตกลงที่จะชดใช้ความเสียหายให้แก่ผู้สนับสนุนสำหรับบรรดาความสูญเสีย ค่าเสียหาย
                และ/หรือค่าใช้จ่ายทั้งปวง อันเป็นผลมาจากการที่ผู้ใช้งานละเมิดหรือผิดเงื่อนไขข้อใดๆ ในสัญญานี้</p>
            <p>&nbsp;</p>
            <p>9. เหตุสุดวิสัย</p>
            <p>ผู้สนับสนุนไม่ต้องรับผิดในความล่าช้าหรือการไม่ปฏิบัติตามสัญญาเพราะสุดวิสัย อัคคีภัย อุทกภัย อุบัติเหตุ
                การจราจล สงคราม การแทรกแซงของรัฐ การนัดหยุดงาน ปัญหาด้านแรงงาน ความบกพร่องของอุปกรณ์
                หรือเหตุอื่นใดที่อยู่นอกเหนือการควบคุมของผู้สนับสนุน</p>
            <p>&nbsp;</p>
            <p>10. การไม่รับประกันข้อยกเว้นความรับผิดและการปลดเปลื้องจากความรับผิด</p>
            <p>10.1 การไม่รับประกัน</p>
            <p>(1) เว้นแต่กฎหมายจะบัญญัติไว้โดยเฉพาะ KATO MANGO VOTE
                ไม่มีความสัมพันธ์พิเศษหรือหน้าที่เกี่ยวกับความซื่อสัตย์ต่อผู้ใช้งาน ผู้ใช้งานรับทราบว่า KATO MANGO VOTE
                ไม่มีอำนาจในการควบคุมหรือหน้าที่ในการปฏิบัติเกี่ยวกับว่าผู้ใช้งานรายใดจะเข้าใช้บริการ
                หรือเนื้อหาใดที่ผู้ใช้งานจะได้รับจากการใช้บริการ หรือผลกระทบของเนื้อหาที่มีต่อผู้ใช้งาน
                หรือการดำเนินการใดที่ผู้ใช้งานจะปฏิบัติอันเป็นผลมาจากการได้รับเนื้อหาดังกล่าว</p>
            <p>(2)
                บริการอาจประกอบไปด้วยหรือเชื่อมโยงผู้ใช้งานไปยังเว็บไซต์อื่นที่มีข้อมูลที่บุคคลบางคนรู้สึกไม่พอใจหรือเห็นว่าไม่เหมาะสม
                ดังนั้น KATO MANGO VOTE &nbsp;จึงไม่อาจรับรองถึงรายละเอียดของเนื้อหาใดๆ
                ที่ปรากฏหรือสามารถเข้าถึงได้โดยการใช้บริการ และ KATO MANGO VOTE
                &nbsp;จะไม่รับผิดชอบหรือรับผิดต่อความถูกต้อง การร้องเรียนเกี่ยวกับลิขสิทธิ์ ความชอบด้วยกฎหมาย
                หรือความเหมาะสมของเนื้อหาที่แสดงหรือเข้าถึงได้โดยผ่านการใช้บริการ</p>
            <p>(3) แอปพลิเคชันและการบริการตลอดจนเนื้อหาต่างๆ ดังกล่าวเป็นการจัดให้มี "ตามสภาพ" และ "ตามที่ปรากฏ"
                โดยปราศจากคำรับรองหรือรับประกันไม่ว่าในลักษณะใดๆ และไม่ว่าโดยตรงหรือโดยปริยาย</p>
            <p>(4) web app microsite KATO MANGO VOTE &nbsp;ตลอดจนกรรมการ ผู้ถือหุ้น พนักงาน ตัวแทน ผู้แทน หุ้นส่วน
                ไม่รับประกันว่า</p>
            <p>(ก) บริการจะปลอดภัยและสามารถใช้งานได้ทุกที่หรือทุกเวลา</p>
            <p>(ข) บรรดาความบกพร่องจะได้รับการแก้ไขให้ถูกต้อง</p>
            <p>(ค) ผู้ใช้งานจะพึงพอใจผลการใช้บริการตามที่คาดหวังไว้</p>
            <p>(ง) ผู้ใช้งานจะได้รับรางวัลจากผู้สนับสนุน หรือหากได้รับ รางวัลดังกล่าวจะมีสี คุณภาพ จำนวน
                หรือคุณสมบัติตรงตามที่ผู้สนับสนุนแสดงหรือประกาศไว้ในแคมเปญ</p>
            <p>ผู้ใช้งานเป็นผู้รับความเสี่ยงภัยจากการใช้งานเว็บไซต์ โปรแกรม บริการ ระแบบและเนื้อหาเองแต่เพียงผู้เดียว
            </p>
            <p>10.2 ข้อยกเว้นความรับผิด</p>
            <p>web app microsite KATO MANGO VOTE จะไม่รับผิดชอบต่อการสูญหายของสิทธิ์ การสูญเสียรายได้ กำไร สัญญา
                ชื่อเสียง ธุรกิจ โอกาส หรือความเสียหายใดๆอันเนื่องมากจากความผิดพลาดของข้อมูล
                ไม่ว่าจะเป็นผลมาจากการทำละเมิด การผิดสัญญาหรือไม่ก็ตาม</p>
            <p>10.3 การปลดเปลื้องจากความรับผิด</p>
            <p>ผู้ใช้งานตกลงแบบเพิกถอนไม่ได้ในการปลดเปลื้องผู้สนับสนุนจากบรรดาความรับผิดหรือความเสียหายทั้งหมดทั้งปวงที่เกิดขึ้นกับผู้ใช้งานอันเป็นผลมาจากการใช้บริการบนแอปพลิเคชัน
                KATO MANGO VOTE นี้</p>
            <p>&nbsp;</p>
            <p>11. หน้าที่ของผู้ใช้งาน</p>
            <p>11.1 ผู้สนับสนุนอาจกำหนดข้อตกลงและเงื่อนไขเกี่ยวกับแคมเปญของผู้สนับสนุนเอง
                และผู้ใช้งานตกลงที่จะยอมรับและผูกพันตามข้อตกลงและเงื่อนไขดังกล่าว</p>
            <p>11.2 ผู้ใช้งานรับรองว่าบรรดาข้อมูลที่ให้ไว้ในการสมัครสมาชิกบัญชี KATO MANGO VOTE
                ภายใต้ข้อตกลงและเงื่อนไขนี้เป็นข้อมูลที่แท้จริง ครบถ้วนและถูกต้อง และ
                ผู้ใช้งานจะแก้ไขในทันทีที่มีการเปลี่ยนแปลงข้อมูลดังกล่าวเพื่อทำให้ข้อมูลเกี่ยวกับบัญชีของผู้ใช้งานเป็นปัจจุบัน
            </p>
            <p>11.3 ผู้ใช้งานตกลงที่จะไม่ใช้หรืออนุญาตให้บุคคลอื่นใช้งานบนแอปพลิเคชัน KATO MANGO VOTE
                โดยไม่จำกัดแต่เพียงในกรณีดังต่อไปนี้</p>
            <p>(1) ส่งหรือรับสื่อที่มีลักษณะเป็นการข่มขู่ ก้าวร้าว หยาบคาย ลามก คุกคาม
                ดูหมิ่นเหยียดหยามหรือหมิ่นประมาทบุคคลใดๆ ดูหมิ่นหรือละเมิดอำนาจศาล ลิขสิทธิ์ สิทธิของบุคคล
                การเผยแพร่หรือความเป็นส่วนตัว หรือสิทธิของบุคคลอื่น</p>
            <p>(2) ส่งหรือรับสื่อที่ผู้ใช้งานไม่ได้รับอนุญาตหรือได้รับความยินยอม
                ซึ่งอาจก่อให้เกิดหรือยุยงให้เกิดการกระผิดทางอาญา หรือความผิดในทางแพ่ง หรือไม่ว่าในลักษณะใดๆ
                ที่เป็นการขัดต่อกฎหมายหรือละเมิดสิทธิของบุคคลอื่นไม่ว่าจะอยู่ในประเทศใดในโลก</p>
            <p>(3) ส่งหรือรับสื่อใดๆ ที่เป็นอันตรายในทางเทคนิค (รวมถึงไวรัสคอมพิวเตอร์ logic bombs, Trojan horses,
                worms, ส่วนประกอบที่เป็นอันตราย ข้อมูลที่บกพร่อง
                หรือซอฟท์แวร์ที่มีเจตนามุ่งร้ายหรือข้อมูลที่เป็นอันตราย)</p>
            <p>(4) ก่อให้เกิดความรำคาญ ไม่สะดวกสบาย หรือก่อให้เกิดความกังวลโดยไม่มีเหตุอันสมควร</p>
            <p>(5) สกัดกั้นหรือพยายามสกัดกั้นการส่งผ่านข้อมูลสำหรับการสื่อสารโดยระบบโทรคมนาคม</p>
            <p>(6) เพื่อประโยชน์อื่นนอกเหนือจากวัตถุประสงค์ที่ออกแบบมาหรือวัตถุประสงค์การใช้งาน</p>
            <p>(7) เพื่อวัตถุประสงค์ในการฉ้อโกง</p>
            <p>(8) ไม่เป็นไปตามหรือสอดคล้องกับวิธีปฏิบัติเกี่ยวกับอินเตอร์เน็ทหรือการเชื่อต่อเน็ทเวิร์คอันเป็นที่ยอมรับ
            </p>
            <p>(9) การกระทำใดๆ ที่เป็นการก่อให้เกิดความเกลียดชังในเชื้อชาติ ศาสนา หรือคนกลุ่มน้อย
                หรืออันเป็นการทำให้เกิดผลอย่างมีนัยสำคัญต่อบุคคล กลุ่มบุคคล หรือเอกลักษณ์</p>
            <p>11.4 การใช้บริการดังต่อไปนี้ เป็นการกระทำที่ต้องห้ามโดยชัดแจ้งและผู้ใช้งานตกลงที่จะไม่กระทำการดังกล่าว
                (หรือยินยอมให้บุคคลอื่นกระทำการดังกล่าว)</p>
            <p>(1)
                ความพยายามในการหลีกเลี่ยงระบบความปลอดภัยหรือเครือข่ายรวมถึงการเข้าถึงข้อมูลที่มิได้มิไว้สำหรับผู้ใช้งาน
                การถึงเครื่องบริการ (Server) หรือบัญชีที่ผู้ใช้งานไม่ได้รับอนุญาตโดยชัดแจ้งให้เข้าถึงได้
                หรือการแทรกแซงระบบความปลอดภัยของระบบเครือข่ายอื่น (เช่น running a port scan)</p>
            <p>(2) การกระทำใดเพื่อตรวจดูเครือข่ายซึ่งจะสกัดกั้นข้อมูลที่ไม่ได้มีไว้สำหรับผู้ใช้งาน</p>
            <p>(3) ดำเนินการอันเป็นการกระทำที่ผิดกฎหมายเกี่ยวกับการใช้แอปพลิเคชัน และ/หรือ บริการ</p>
            <p>(4) ดำเนินการในลักษณะใดๆ (ตามความเห็นของผู้สนับสนุนแต่เพียงผู้เดียว)
                ที่เป็นการจำกัดหรือขัดขวางผู้ใช้งานรายอื่นจากการใช้งานหรือเพลิดเพลินกับการใช้งานแอปพลิเคชันและบริการ</p>
            <p>(5) ส่งข้อความใดๆ
                ในทางที่จะทำให้บุคคลอื่นเชื่อว่าหรือเข้าใจว่าข้อความดังกล่าวได้ถูกส่งหรือเปิดเผยโดยความสนับสนุนหรือความยินยอมของผู้สนับสนุน
            </p>
            <p>&nbsp;</p>
            <p>12. เบ็ดเตล็ด</p>
            <p>12.1 หัวข้อต่างๆ</p>
            <p>หัวข้อต่างๆ
                ที่ใช้ในสัญญานี้มีไว้เพื่อความสะดวกในการอ้างถึงเท่านั้นและไม่ถือเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขนี้
                และไม่มีผลต่อการตีความสัญญา</p>
            <p>12.2 ความไม่เป็นหุ้นส่วนและตัวแทน</p>
            <p>ไม่มีข้อความใดๆ ในสัญญานี้สามารถตีความได้ว่าผู้ใช้งานและผู้สนับสนุนมีการร่วมทุน เข้าเป็นหุ้นส่วนบริษัท
                หรือมีความสัมพันธ์เป็นตัวการและตัวแทนในรูปแบบใดๆ โดยผู้สนับสนุน และผู้ใช้งานไม่มีอำนาจที่จะกระทำการใดๆ
                แทนอีกฝ่ายในการที่จะก่อให้เกิดความรับผิดในหนี้ ค่าใช้จ่าย เข้าเป็นคู่สัญญา หรือการใดๆ แทนกัน</p>
            <p>12.3 กฎหมายที่บังคับใช้</p>
            <p>ข้อกำหนดและเงื่อนไขนี้อยู่ภายใต้บังคับและการตีความของกฎหมายแห่งราชอาณาจักรไทย
                โดยคู่สัญญาทั้งสองฝ่ายตกลงให้ศาลไทยเป็นผู้มีอำนาจในการชี้ขาดประเด็นข้อพิพาททั้งปวง</p>
            <p>12.4 ทรัพย์สิทธิ</p>
            <p>เนื้อหาที่อยู่บนแอปพลิเคชันรวมถึงข้อมูล โปรแกรมคอมพิวเตอร์ รูปภาพ กราฟ วีดีโอ หน้าตัวพิมพ์ กราฟฟิค ดนตรี
                เสียงหรือสิ่งอื่นๆ (เรียกรวมกันว่า "เนื้อหา") ได้รับความคุ้มครองจากลิขสิทธิ์ เครื่องหมายการค้า สิทธิบัตร
                หรือทรัพยสิทธิอื่น โดยเนื้อหาทั้งหมดถือเป็นลิขสิทธิ์ของผู้สนับสนุนภายใต้กฎหมายลิขสิทธิ์ของประเทศไทย
                ผู้ใช้งานไม่สามารถที่จะทำซ้ำ ดัดแปลง ลบทิ้ง เพิ่มเติม เผยแพร่ ส่งต่อ หรือมีส่วนร่วมในการโอน หรือขาย
                ให้เช่าซื้อหรือเช่า
                หรือนำไปดัดแปลงเป็นผลงานอื่นไม่ว่าส่วนหนึ่งส่วนใดหรือทั้งหมดเว้นแต่จะได้รับอนุญาตโดยชัดแจ้งจากผู้มีอำนาจให้ความยินยอม
            </p>
            <p>12.5 สิทธิของบุคคลภายนอก</p>
            <p>ข้อกำหนดทั้งหมดของสัญญานี้ใช้และให้ประโยชน์กับบริษัท โมบาย คอนเน็ค จำกัด
                บริษัทในเครือสังกัดและบริษัทที่ถือหุ้นในโมบาย คอนเน็ค (หรือ)
                บริษัทในเครือและบุคคลภายนอกที่เป็นผู้จัดทำและได้รับอนุญาตโดยเท่าเทียมกัน
                โดยบุคคลและองค์กรที่กล่าวมานี้มีสิทธิในการใช้สิทธิและบังคับใช้สิทธิตามข้อกำหนดของสัญญานี้โดยตรงหรือผ่านทางตัวแทน
                (เว้นแต่สัญญานี้ได้ถูกเปลี่ยนแปลงหรือยกเลิกโดยไม่ได้รับความยินยอมจากบุคคลหรือองค์กรดังกล่าว)
                นอกจากที่ได้กล่าวมาข้างต้นสัญญานี้ไม่มีผลผูกพันหรือให้สิทธิในการบังคับตามสัญญากับบุคคลอื่นที่ไม่ใช่คู่สัญญา
            </p>
            <p>12.6 การจัดทำแอปพลิเคชัน KATO MANGO VOTE ทั้งนี้ทางผู้สนับสนุน บริษัท ทวีผลผลิตภัณฑ์ จำกัด เลขที่ 101
                ถนนชักพระ แขวงคลองชักพระ เขตตลิ่งชัน กรุงเทพฯ 10170
                ไม่มีส่วนเกี่ยวข้องในการรับผิดชอบกรณีมีข้อผิดพลาดใดๆทั้งสิ้นที่เกิดขึ้นการผู้รับจ้าง</p>
            <p>บริษัท โมบาย คอนเน็ค จำกัด เป็นเจ้าของและผู้ดำเนินการเขียนโปรแกรม ระบบ และบริการของแอปพลิเคชัน KATO MANGO
                VOTE ขึ้น ทั้งนี้เป็นนิติบุคคลที่จัดตั้งขึ้นและคงอยู่ตามกฎหมายของประเทศไทย ที่ทำการอยู่ที่ โมบาย คอนเน็ค
                จำกัด ที่ทำการอยู่ที่ 1111/84 ถนนลาดพร้าว แขวงจันทรเกษม เขตจตุจักร กรุงเทพมหานคร 10900 ประเทศไทย</p>
            <p>12.7 ความมีผลของสัญญา</p>
            <p>ผู้ใช้งานและผู้สนับสนุนเข้าทำสัญญานี้ (หรือข้อตกลงและเงื่อนไข) โดยระบบอิเล็กทรอนิกส์
                ซึ่งมีผลและใช้บังคับได้ตามพระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พุทธศักราช 2544
                ด้วยเหตุนี้จึงจำต้องลงลายมือชื่อในทางกายภาพ</p>
        </v-card-text>
        <v-divider></v-divider>
        <v-card-actions>
          <v-layout justify-center>
            <v-btn color="#808080" class="white--text" @click="closePDPA('pdpa')"
            width="150px">
              ไม่ยอมรับ
            </v-btn>
          </v-layout>
          <v-layout justify-center>
            <v-btn color="#018657" class="white--text" @click="confirm('pdpa')"
            width="150px"
            >
              ยอมรับ
            </v-btn>
          </v-layout>
        </v-card-actions>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
export default {
  props: ["showPDPA"],
  methods: {
    closePDPA(text) {
      this.$emit("next", { type: text });
    },
    confirm(text) {
      this.$emit("submit", { type: text });
    },
  },
};
</script>

<style>
</style>
